 {
  "First_and_Last_Name": "CeCelia M. Fernandes",
  "About": "CeCelia M. Fernandes practices as an  Acupuncturist in Casa Grande, AZ.",
  "Services": [
    "CeCelia M. Fernandes is an Acupuncturist or Acupuncture office in Casa Grande, AZ. Call CeCelia M. Fernandes at (520) 421-1862 for a detailed description of the services offered. ",
    "Acupuncturist like CeCelia M. Fernandes offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at CeCelia M. Fernandes for information about your acupuncture needs in Casa Grande, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(520) 421-1862",
  "Address": "1172 E. Delano Drive, Casa Grande, AZ  85222"
}
{
  "First_and_Last_Name": "TRAVIS BACHERT, D.C., F.I.A.M.A",
  "About": "We are more than a typical chiropractic clinic, treating the whole body rather than just symptoms. Our goal is to help patients reach their full health potential through treatment and education.",
  "Services": [
    "Dr. Travis Bachert specializes in CPK (Chiropractic Plus Kinesiology), and uses the Brimhall technique, Cold Laser Therapy, Tapas Acupressure Technique, Allergy/Sensitivity Elimination Reprogramming Technique, Acupuncture Meridian Therapy, Auriculotherapy, Activator, Applied Kinesiolgy, and Nutrition. Dr. Deanna Bachert is a doctor of chiropractic, and uses nutrition, cold laser therapy, percussor, kinesio tape, applied kinesiology, upper cervical technique, SOT, gonstead, and detox/cleanses."
  ],
  "Primary_Specialty": "Chiropractic Nutritionist",
  "Practice": "18",
  "Education": [],
  "Training": [],
  "Phone": "(479) 273-7301",
  "Address": "2717 SE I St. Ste. #7, Bentonville, AR  72712"
}
{
  "First_and_Last_Name": "Elyse Tera, BA.L.Ac. Dipl.Ac.",
  "About": "Elyse Tera, BA.L.Ac. Dipl.Ac. practices as an  Acupuncturist in Yuma, AZ.She graduated from New England School of Acupuncture and has been practicing since 2000.",
  "Services": [
    "Elyse Tera, BA.L.Ac. Dipl.Ac. is an Acupuncturist or Acupuncture office in Yuma, AZ. Call Acupuncture of Yuma LLC at (928) 328-1975 for a detailed description of the services offered. ",
    "Acupuncturist like Elyse Tera, BA.L.Ac. Dipl.Ac. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Acupuncture of Yuma LLC for information about your acupuncture needs in Yuma, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "20",
  "Education": [
    "New England School of Acupuncture"
  ],
  "Training": [
    "Dragon & Phoenix School of Shiatsu, Montreal 1994.   NESA 2000. ",
    "Shiatsu, Asian Bodywork, Acupuncture, Stress Management, Chinese Injury Medicine"
  ],
  "Phone": "(928) 328-1975",
  "Address": "710 W.16th Street, Yuma, AZ  85364"
}
{
  "First_and_Last_Name": "Kevin Kral",
  "About": "Kevin Kral practices as an  Acupuncturist in Yuma, AZ.",
  "Services": [
    "Kevin Kral is an Acupuncturist or Acupuncture office in Yuma, AZ. Call Kevin Kral at (928) 539-5128 for a detailed description of the services offered. ",
    "Acupuncturist like Kevin Kral offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Kevin Kral for information about your acupuncture needs in Yuma, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(928) 539-5128",
  "Address": "3250 S. 4th Ave Suite F, Yuma, AZ  85365"
}
{
  "First_and_Last_Name": "Dru Kindred",
  "About": "Dru Kindred practices as an  Acupuncturist in Ketchikan, AK.",
  "Services": [
    "Dru Kindred is an Acupuncturist or Acupuncture office in Ketchikan, AK. Call Dru Kindred at (907) 225-7359 for a detailed description of the services offered. ",
    "Acupuncturist like Dru Kindred offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Dru Kindred for information about your acupuncture needs in Ketchikan, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(907) 225-7359",
  "Address": "2851 Tongass Avenue, Ketchikan, AK  99901"
}
{
  "First_and_Last_Name": "Janice K. Royce",
  "About": "Janice K. Royce practices as an  Acupuncturist in Anchorage, AK.",
  "Services": [
    "Janice K. Royce is an Acupuncturist or Acupuncture office in Anchorage, AK. Call Janice K. Royce at (907) 830-0273 for a detailed description of the services offered. ",
    "Acupuncturist like Janice K. Royce offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Janice K. Royce for information about your acupuncture needs in Anchorage, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(907) 830-0273",
  "Address": "3600 Lake Otis Parkway, Ste. 200, Anchorage, AK  99508"
}
{
  "First_and_Last_Name": "John E. Stuckey, O.D.",
  "About": "John E. Stuckey, O.D. practices as an  Acupuncturist in Little Rock, AR.",
  "Services": [
    "John E. Stuckey, O.D. is an Acupuncturist or Acupuncture office in Little Rock, AR. Call John E. Stuckey, O.D. at (501) 227-6797 for a detailed description of the services offered. ",
    "Acupuncturist like John E. Stuckey, O.D. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at John E. Stuckey, O.D. for information about your acupuncture needs in Little Rock, AR."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(38 Reviews)",
  "Phone": "(501) 227-6797",
  "Address": "9600 Lile Dr, Suite 230, Little Rock, AR  72205"
}
{
  "First_and_Last_Name": "Li Hsu",
  "About": "Li Hsu practices as an  Acupuncturist in Searcy, AR.",
  "Services": [
    "Li Hsu is an Acupuncturist or Acupuncture office in Searcy, AR. Call United Health at (508) 650-6988 for a detailed description of the services offered. ",
    "Acupuncturist like Li Hsu offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at United Health for information about your acupuncture needs in Searcy, AR."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(7 Reviews)",
  "Phone": "(508) 650-6988",
  "Address": "1003 Golf View Drive, Searcy, AR  72143"
}
{
  "First_and_Last_Name": "Aubrey Backaric, Owner",
  "About": "We make acupuncture affordable for all! Pay what you can afford!",
  "Services": [
    "Community Acupuncture",
    "Acupuncture, Chiropractic"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(520) 822-7385",
  "Address": "312 W 10TH ST 2, Casa Grande, AZ  85122"
}
{
  "First_and_Last_Name": "Sarah Ronald Hauer",
  "About": "Sarah Ronald Hauer practices as an  Acupuncturist in Sedona, AZ.",
  "Services": [
    "Sarah Ronald Hauer is an Acupuncturist or Acupuncture office in Sedona, AZ. Call Sarah Ronald Hauer at (928) 282-0882 for a detailed description of the services offered. ",
    "Acupuncturist like Sarah Ronald Hauer offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Sarah Ronald Hauer for information about your acupuncture needs in Sedona, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(928) 282-0882",
  "Address": "65 Coffee Pot Dr Ste D, Sedona, AZ  86336"
}
{
  "First_and_Last_Name": "Stephen Zhao",
  "About": "Stephen Zhao practices as an  Acupuncturist in Hoover, AL.",
  "Services": [
    "Stephen Zhao is an Acupuncturist or Acupuncture office in Hoover, AL. Call Stephen Zhao at (205) 822-5552 for a detailed description of the services offered. ",
    "Acupuncturist like Stephen Zhao offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Stephen Zhao for information about your acupuncture needs in Hoover, AL."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(4 Reviews)",
  "Phone": "(205) 822-5552",
  "Address": "1564 Montgomery Hwy., Hoover, AL  35216"
}
{
  "First_and_Last_Name": "Nira Givon",
  "About": "Nira Givon practices as an  Acupuncturist in Kodiak, AK.",
  "Services": [
    "Nira Givon is an Acupuncturist or Acupuncture office in Kodiak, AK. Call Nira Givon at (907) 486-6707 for a detailed description of the services offered. ",
    "Acupuncturist like Nira Givon offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Nira Givon for information about your acupuncture needs in Kodiak, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(5 Reviews)",
  "Phone": "(907) 486-6707",
  "Address": "PO Box 1907, Kodiak, AK  99615"
}
{
  "First_and_Last_Name": "William Pettis",
  "About": "William Pettis practices as an  Acupuncturist in Jonesboro, AR.",
  "Services": [
    "William Pettis is an Acupuncturist or Acupuncture office in Jonesboro, AR. Call William Pettis at (870) 619-4098 for a detailed description of the services offered. ",
    "Acupuncturist like William Pettis offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at William Pettis for information about your acupuncture needs in Jonesboro, AR."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(870) 619-4098",
  "Address": "323 S. Church Street, Jonesboro, AR  72401"
}
{
  "First_and_Last_Name": "Erik Hardin, L.Ac.",
  "About": "Ozark Integrative Wellness Center in Mountain Home, Arkansas offers acupuncture, herbal medicine, dietary counseling, educational, and health products.  Operated by Erik Hardin, M.A.O.M., L.Ac.  Call or visit the website for more information.",
  "Services": [
    "Acupuncture, Moxabustion, Electro-acupuncture, Auricular acupuncture, heat therapy, Customized Herbal Medicine, Individualized Nutritional Counseling, Qigong instruction, Cooking Classes."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(5 Reviews)",
  "Phone": "(870) 421-4368",
  "Address": "505 S. Main Street, Mountain Home, AR  72653"
}
{
  "First_and_Last_Name": "Alaska Center for Acupuncture",
  "About": "Alaska Center for Acupuncture in Palmer, Alaska (AK) has been improving the health and vitality of their community for over seven years.  The practitioners, Kevin Meddleton and Samantha Berg combine traditional acupuncture and Chinese herbal medicine to provide holistic, comprehensive care that provides immediate relief from chronic pain.",
  "Services": [
    "Alaska Center for Acupuncture in Palmer, Alaska (AK) offers a wide variety of treatment options including Chinese herbal therapy, Cupping, and Moxibustion. Moxibustion involves the gentle warming of specific points on the body to facilitate healing. Alaska Center for Acupuncture's treatment involves the gentle insertion of fine, hair-width needles to stimulate healing responses throughout the body. They also utilize a Chinese herbal formula to support the healing process. Those suffering from chronic pain or illness, women's health issues, or stress related ailments are offered immediate relief and quality care. If seeking superior service and lasting results, call Alaska Center for Acupuncture in Palmer, Alaska (AK) to schedule an appointment."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "17",
  "Education": [
    "Cornell University, Ithaca, NY",
    "Traditional Acupuncture Institute, Laurel, MD"
  ],
  "Training": [
    "Five Element Acupuncture",
    "Traditional Chinese Medicine",
    "Contemporary Chinese Pulse Diagnosis"
  ],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(907) 745-8688",
  "Address": "642 S. Alaska St. Ste. 208, Palmer, AK  99645"
}
{
  "First_and_Last_Name": "Ping Rice",
  "About": "Ping Rice practices as an  Acupuncturist in Anchorage, AK.",
  "Services": [
    "Ping Rice is an Acupuncturist or Acupuncture office in Anchorage, AK. Call Ping Rice at (907) 345-7146 for a detailed description of the services offered. ",
    "Acupuncturist like Ping Rice offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Ping Rice for information about your acupuncture needs in Anchorage, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(907) 345-7146",
  "Address": "17015 Nickleen St., Anchorage, AK  99516"
}
{
  "First_and_Last_Name": "Kevin M Kral",
  "About": "Kevin M Kral practices as an  Acupuncturist in Yuma, AZ.",
  "Services": [
    "Kevin M Kral is an Acupuncturist or Acupuncture office in Yuma, AZ. Call Kevin M Kral at (928) 539-5128 for a detailed description of the services offered. ",
    "Acupuncturist like Kevin M Kral offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Kevin M Kral for information about your acupuncture needs in Yuma, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": null,
  "Phone": "(928) 539-5128",
  "Address": "3250 S. 4th Ave, #F, Yuma, AZ  85364"
}
{
  "First_and_Last_Name": "Aria Walker, L.Ac., M.Ac., Dipl. Ac",
  "About": "Aria Walker is a licensed acupuncturist with a master’s degree in acupuncture and Chinese herbal studies from Academy for Five Element Acupuncture. She also studied Traditional Chinese Medicine (TCM) and herbs at Pacific College of Oriental Medicine, San Diego, and assisted a third generation acupuncturist from a family tradition. She has been working and teaching in complementary medicine since 1991. ",
  "Services": [
    "Five Element Acupuncture",
    "Five Element Acupuncture is a constitutionally-based style of acupuncture for addressing many types of health and internal medicine concerns, life transitions, stresses, and personal improvement. During your initial intake appointment, your acupuncturist will have an in-depth discussion with you regarding your life, well-being, and goals. Five Element Acupuncture begins with clearing sessions to remove blocks to your dynamic health and then supports movement toward your personal ideal. The customized treatments are tailored for each individual’s needs.",
    "Health & Well-being Initial Consultation & Treatment: ",
    "This session includes your first Five Element Acupuncture treatment and sets you on the path of deeper healing. ",
    "Five Element Treatment:",
    "As follow-up to your initial appointment, or as regular maintenance, these personalized sessions continue your profound healing journey. ",
    "Acupuncture Mini-Consultation/Treatment:",
    "This hour-long session is a one-time opportunity to experience acupuncture prior to a full initial consultation.",
    "Please come in for a complimentary 15-minute consultation to learn how acupucture and Oriental medicine can help you.",
    "Chinese Herbs, Moxibustion, Gua Sha"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(907) 268-1692",
  "Address": "717 Barrow St, Anchorage, AK  99501"
}
{
  "First_and_Last_Name": "Ron Fishkind, L.Ac",
  "About": "Ron Fishkind, L.Ac practices as an  Acupuncturist in Sun City, AZ.",
  "Services": [
    "Ron Fishkind, L.Ac is an Acupuncturist or Acupuncture office in Sun City, AZ. Call Room For Health at (623) 972-2141 for a detailed description of the services offered. ",
    "Acupuncturist like Ron Fishkind, L.Ac offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Room For Health for information about your acupuncture needs in Sun City, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(11 Reviews)",
  "Phone": "(623) 972-2141",
  "Address": "18700 N. 107 Ave #32, Sun City, AZ  85373"
}
{
  "First_and_Last_Name": "Janice Royce",
  "About": "Janice Royce practices as an  Acupuncturist in Anchorage, AK.",
  "Services": [
    "Janice Royce is an Acupuncturist or Acupuncture office in Anchorage, AK. Call Janice Royce at (907) 830-0273 for a detailed description of the services offered. ",
    "Acupuncturist like Janice Royce offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Janice Royce for information about your acupuncture needs in Anchorage, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(907) 830-0273",
  "Address": "3600 Lake Otis Parkway, Ste. 200, Anchorage, AK  99508"
}
{
  "First_and_Last_Name": "Raymond Siegfriede Hauer",
  "About": "Raymond Siegfriede Hauer practices as an  Acupuncturist in Sedona, AZ.",
  "Services": [
    "Raymond Siegfriede Hauer is an Acupuncturist or Acupuncture office in Sedona, AZ. Call Raymond Siegfriede Hauer at (928) 282-0882 for a detailed description of the services offered. ",
    "Acupuncturist like Raymond Siegfriede Hauer offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Raymond Siegfriede Hauer for information about your acupuncture needs in Sedona, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(928) 282-0882",
  "Address": "65 Coffee Pot Dr Ste D, Sedona, AZ  86336"
}
{
  "First_and_Last_Name": "Mary Fedoroff, RN",
  "About": "Mary Fedoroff is a registered nurse and specializes in cosmetic enhancement in Anchorage, AK at Faces, Alaska's first and longest standing medical spa and laser center. Mary is devoted to patients' aesthetic skin care and uses only proven therapies and products for optimal results. She specializes in treating acne, rosacea, brown spots, wrinkles, spider veins, and scars. Mary Fedoroff uses her medical training and experience in non-invasive cosmetic enhancement to develop a treatment plan that is safe, comfortable and effective. Faces uses light and laser therapies that focus on treating sun damage (brown spots, wrinkles), facial and leg spider veins, and removing unwanted hair. Mary brings a wealth of clinical health care experience to Faces and has completed many hours of continuing education, including advanced techniques with injections, Botox, chemical peels, and facial laser applications. Mary is dedicated to helping her patients maintain youthful appearing skin so that they can feel beautiful inside and out. ",
  "Services": [
    "As a specialist in cosmetic enhancement in Anchorage, AK, Mary Fedoroff is proud to provide patients with the most advanced procedures as well as the very latest, clinically safe, and proven technologies for a wide variety of medically elective cosmetic procedures. Some of the services provided include Botox, spider vein removal, scar and wrinkle treatment, and hair removal. Faces uses only products and procedures approved by the FDA for rosacea, brownspots, laser peels, and scar treatments. Mary offers many services not available at other spas in the area due to her advanced education, training, and experience in the field. To receive an initial consultation for cosmetic enhancement in Anchorage, AK, please call Mary Fedoroff at Faces today."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(3 Reviews)",
  "Phone": null,
  "Address": null
}
{
  "First_and_Last_Name": "Jeanette Campbell",
  "About": "Jeanette Campbell practices as an  Acupuncturist in Cottonwood, AZ.",
  "Services": [
    "Jeanette Campbell is an Acupuncturist or Acupuncture office in Cottonwood, AZ. Call Verde Valley Acupuncture at (928) 639-3700 for a detailed description of the services offered. ",
    "Acupuncturist like Jeanette Campbell offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Verde Valley Acupuncture for information about your acupuncture needs in Cottonwood, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(5 Reviews)",
  "Phone": "(928) 639-3700",
  "Address": "719 N. 5th Street, Cottonwood, AZ  86326"
}
{
  "First_and_Last_Name": "Cynthia Hull, Llicensed Acupuncturist",
  "About": "The Acupuncture Wellness Center offers experienced practitioners, each with over 20 years of experience in their fields.",
  "Services": [
    "Acupuncture, Chinese Medicine, Herbs, Acupressure, Massage Therapy,Tai Chi Classes, Crainiosacral Therapy, Allergy Elimination, Reiki, Holistic Weight Loss, Pain Relief, Carpal Tunnel Treatment, Sports Injury Treatment, Acupuncture & Herbs for Migraines, Headaces, and Neurological Disorders. Treatments for menopause and womens health issues. Pregnancy massage & pregnancy follow up treatment.",
    "Allergy Elimination ,Therapeutic Bodywork"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "29",
  "Education": [
    "Master of Acupuncture Degree from Southwest Acupuncture College"
  ],
  "Training": [
    "Acupuncture, Chinese Herbolgy, Massage Therapy and Tui Na, Allergy Elimination, Reiki"
  ],
  "Consumer_Feedback": "(9 Reviews)",
  "Phone": "(928) 773-0272",
  "Address": "318 W Birch Ave Ste 5, Flagstaff, AZ  86001"
}
{
  "First_and_Last_Name": "Acupuncture-Herbal Center Steve Stubenrauch OMD",
  "About": "Acupuncture-Herbal Center Steve Stubenrauch OMD is a Acupuncturist facility at 2708 North 4th Street Suite E-4 in Flagstaff, AZ.",
  "Services": [
    "Acupuncture-Herbal Center Steve Stubenrauch OMD is an Acupuncturist or Acupuncture office in Flagstaff, AZ. Call Acupuncture-Herbal Center Steve Stubenrauch OMD at (928) 522-9099 for a detailed description of the services offered. ",
    "Acupuncturist like Acupuncture-Herbal Center Steve Stubenrauch OMD offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Acupuncture-Herbal Center Steve Stubenrauch OMD for information about your acupuncture needs in Flagstaff, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(4 Reviews)",
  "Phone": "(928) 522-9099",
  "Address": "2708 North 4th Street Suite E-4, Flagstaff, AZ  86004"
}
{
  "First_and_Last_Name": "Stephanie Selman, L.Ac.",
  "About": "Turning Point Acupuncture has been providing care in Flagstaff since 1997. Stephanie Selman L.Ac. offers a wide variety of treament and cost options. Stephanie Selman has an expansive history of treating chronic pain issues as well as general health concerns. At Turning Point we offer individual sessions as well as community style and couples acupuncture. For more information please see our website.",
  "Services": [
    "Stephanie Selman, L.Ac. is an Acupuncturist or Acupuncture office in Flagstaff, AZ. Call Turning Point Acupuncture at (928) 606-2454 for a detailed description of the services offered. ",
    "Acupuncturist like Stephanie Selman, L.Ac. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Turning Point Acupuncture for information about your acupuncture needs in Flagstaff, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(5 Reviews)",
  "Phone": "(928) 606-2454",
  "Address": "519 N. Leroux St., Flagstaff, AZ  86001"
}
{
  "First_and_Last_Name": "Allison Howard, L.Ac.",
  "About": "Allison Howard practices acupuncture in Flagstaff, Arizona (AZ). Allison uses the beauty, simplicity and power of alternative medicine to awaken and balance the body and spirit. Allison is able to help individuals who suffer from a wide range of conditions, including stress, allergies, infertility, headaches and chronic pain. She uses herbal medicine to help with pain and healing, as well as proper nutrition.",
  "Services": [
    "Allison Howard provides many services in addition to acupuncture in Flagstaff, Arizona (AZ). Allison offers cupping, acupuncture and Chinese medicine to heal patients and get them out of pain. Also a certified massage therapist, Allison integrates Chinese medical massage, sports massage and craniosacral therapy into her practice. Allison has helped many people with chronic pain, arthritis, weight problems, addiction, insomnia and infertility among other health issues.",
    "For acupuncture in Flagstaff, AZ, please call Allison Howard today to set up an appointment, or visit her website for more information."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "20",
  "Education": [
    "Allison Howard graduated with a Master's degree in Oriental Medicine from Emperor's College, spent time in Taiwan (1999) and China (2001) for extended studies and has completed an orthopedic specialty with Dr. Hua Gu of the American Acupuncture Academy. She has also studied the pediatric acupuncture technique in Bali, Indonesia, where she worked in Clinic in 2010."
  ],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(928) 213-6919",
  "Address": "2104 North Third Street, Flagstaff, AZ  86004"
}
{
  "First_and_Last_Name": "John L. Stump",
  "About": "John L. Stump practices as an  Acupuncturist in Fairhope, AL.",
  "Services": [
    "John L. Stump is an Acupuncturist or Acupuncture office in Fairhope, AL. Call John L. Stump at (251) 990-8188 for a detailed description of the services offered. ",
    "Acupuncturist like John L. Stump offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at John L. Stump for information about your acupuncture needs in Fairhope, AL."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(251) 990-8188",
  "Address": "315 Magnolia Avenue, Fairhope, AL  36532"
}
{
  "First_and_Last_Name": "Heidi McHardy, Licensed Acupuncturist",
  "About": "We provide quality acupuncture in a group setting on an affordable sliding scale of $15-$35.  ",
  "Services": [
    "Acupuncture and herbal consulation.  ",
    "Community, Acupuncture, pain, wellness, sliding scale, affordable"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 269-0415",
  "Address": "2121 S. Priest Drive 110, Tempe, AZ  85282"
}
{
  "First_and_Last_Name": "Pamella J Wallach",
  "About": "Pamella J Wallach practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Pamella J Wallach is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Pamella J Wallach at (602) 942-4277 for a detailed description of the services offered. ",
    "Acupuncturist like Pamella J Wallach offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Pamella J Wallach for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(602) 942-4277",
  "Address": "1222 E. Acoma Dr., Phoenix, AZ  85022"
}
{
  "First_and_Last_Name": "Pamella J Wallach",
  "About": "Pamella J Wallach practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Pamella J Wallach is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Pamella J Wallach at (602) 274-1885 for a detailed description of the services offered. ",
    "Acupuncturist like Pamella J Wallach offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Pamella J Wallach for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(602) 274-1885",
  "Address": "301 Bethany Home rd., Phoenix, AZ  85012"
}
{
  "First_and_Last_Name": "Andre Zitcer",
  "About": "Andre Zitcer practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Andre Zitcer is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Andre Zitcer at (310) 562-7075 for a detailed description of the services offered. ",
    "Acupuncturist like Andre Zitcer offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Andre Zitcer for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(310) 562-7075",
  "Address": "42424 N Gavilan Peak Pkwy, Phoenix, AZ  85086"
}
{
  "First_and_Last_Name": "A Golden Needle Acupuncture",
  "About": "A Golden Needle Acupuncture is a Acupuncturist facility at 1801 South Jentilly Lane in Tempe, AZ.",
  "Services": [
    "A Golden Needle Acupuncture is an Acupuncturist or Acupuncture office in Tempe, AZ. Call A Golden Needle Acupuncture at (480) 557-9095 for a detailed description of the services offered. ",
    "Acupuncturist like A Golden Needle Acupuncture offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at A Golden Needle Acupuncture for information about your acupuncture needs in Tempe, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 557-9095",
  "Address": "1801 South Jentilly Lane, Tempe, AZ  85281"
}
{
  "First_and_Last_Name": "Danny Bedgood",
  "About": "Danny Bedgood practices as an  Acupuncturist in Tempe, AZ.",
  "Services": [
    "Danny Bedgood is an Acupuncturist or Acupuncture office in Tempe, AZ. Call Danny Bedgood at (602) 274-1878 for a detailed description of the services offered. ",
    "Acupuncturist like Danny Bedgood offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Danny Bedgood for information about your acupuncture needs in Tempe, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(602) 274-1878",
  "Address": "1739 East Broadway Ste 1-101, Tempe, AZ  85282"
}
{
  "First_and_Last_Name": "Tutsie Silapalikitporn",
  "About": "Tutsie Silapalikitporn practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Tutsie Silapalikitporn is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Tutsie Silapalikitporn at (602) 954-4083 for a detailed description of the services offered. ",
    "Acupuncturist like Tutsie Silapalikitporn offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Tutsie Silapalikitporn for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(602) 954-4083",
  "Address": "5315 N 41st Street, Phoenix, AZ  85018"
}
{
  "First_and_Last_Name": "Sherri Taylor",
  "About": "Sherri Taylor practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Sherri Taylor is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Sherri Taylor at (602) 957-2602 for a detailed description of the services offered. ",
    "Acupuncturist like Sherri Taylor offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Sherri Taylor for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(602) 957-2602",
  "Address": "4910 N 44th Street, Phoenix, AZ  85018"
}
{
  "First_and_Last_Name": "Banya Lim L.Ac. ",
  "About": "Banya Lim L.Ac.  is a Acupuncturist facility at 500 Craigmont Drive in Sedona, AZ.",
  "Services": [
    "Banya Lim L.Ac.  is an Acupuncturist or Acupuncture office in Sedona, AZ. Call Banya Lim L.Ac.  at (928) 274-2957 for a detailed description of the services offered. ",
    "Acupuncturist like Banya Lim L.Ac.  offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Banya Lim L.Ac.  for information about your acupuncture needs in Sedona, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(928) 274-2957",
  "Address": "500 Craigmont Drive, Sedona, AZ  86336"
}
{
  "First_and_Last_Name": "Dagmar C. Bauer",
  "About": "Dagmar C. Bauer practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Dagmar C. Bauer is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Dagmar C. Bauer at (602) 954-6425 for a detailed description of the services offered. ",
    "Acupuncturist like Dagmar C. Bauer offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Dagmar C. Bauer for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(602) 954-6425",
  "Address": "3219 E. Camelback Rd., #504, Phoenix, AZ  85018"
}
{
  "First_and_Last_Name": "Chris Lockhart",
  "About": "Chris Lockhart practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Chris Lockhart is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Chris Lockhart at (602) 349-6853 for a detailed description of the services offered. ",
    "Acupuncturist like Chris Lockhart offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Chris Lockhart for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(602) 349-6853",
  "Address": "5628 N.12th Street, Phoenix, AZ  85014"
}
{
  "First_and_Last_Name": "Robert Abrahamson, OMD,LAc",
  "About": "Robert P. Abrahamson O.M.D., L.Ac. (AZ, CA), Dipl.Ac. (NCCAOM) is a Doctor of Oriental Medicine with 41 years experience in the art of Acupuncture and Chinese Medicine. He is both state and nationally certified, and has been working in beautiful West Sedona for the past 23 years.",
  "Services": [
    "Traditional Chinese Medicine (TCM), as well as Tibetan, Japanese, Korean, Tung and Five Element Constitutional acupuncture.",
    "Chinese Herbal medicine",
    "Tui-Na massage",
    "Needless painless laser treatment",
    "Cupping",
    "Moxabustion",
    "Microcurrent stimulation"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "44",
  "Education": [
    "Chinese Schoo of Acupuncture, UK",
    "ChengDu Colege of TCM, PRC"
  ],
  "Training": [
    "In England and PRC China",
    "35 years experience."
  ],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(928) 204-0595",
  "Address": "1785 W Hwy 89A Suite 3D, Sedona, AZ  86336"
}
{
  "First_and_Last_Name": "Jean M. Brennan",
  "About": "Jean M. Brennan practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Jean M. Brennan is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Jean M. Brennan at (718) 343-3813 for a detailed description of the services offered. ",
    "Acupuncturist like Jean M. Brennan offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Jean M. Brennan for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(718) 343-3813",
  "Address": "4646 North 11th Ave., Apt. 119, Phoenix, AZ  85013"
}
{
  "First_and_Last_Name": "Patricia Martin",
  "About": "Patricia Martin practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Patricia Martin is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Patricia Martin at (602) 955-4321 for a detailed description of the services offered. ",
    "Acupuncturist like Patricia Martin offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Patricia Martin for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(602) 955-4321",
  "Address": "3424 East Indian School Rd, Phoenix, AZ  85018"
}
{
  "First_and_Last_Name": "Dr. Jan  Viafora, DC",
  "About": "Dr. Jan Viafora of Mountain Dove Chiropractic Center has offered holistic healing services to Sedona, AZ and the world since 1984. She helps people live up to their potential by decreasing stress, decreasing pain, and re-connecting them to their healing power inside!",
  "Services": [
    "Dr. Jan Viafora of Mountain Dove Healing Center offers healing that empowers you to live out of your highest potential.",
    "GENTLE CHIROPRACTIC- NSA- Network Spinal Analysis, Activator and Impulse Adjustor, Comprehensive Computerized LASER TECHNOLOGY FOR ALLERGIES and Chronic Disorders, Acupuncture, COLD LASER for injuries and rehabilitation, EFT- Emotional Freedom Technique- private sessions, workshops, and self-help worksheets offered, and NET- Neuro-emotional Technique",
    "Acupuncture, Laser, Allergies, Neuro- Emotional Tech.,"
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": "38",
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(11 Reviews)",
  "Phone": "(928) 284-9550",
  "Address": "5 Navajo Rd., Sedona, AZ  86351"
}
{
  "First_and_Last_Name": "Rachelle Marmor",
  "About": "Rachelle Marmor practices as an  Acupuncturist in Tempe, AZ.",
  "Services": [
    "Rachelle Marmor is an Acupuncturist or Acupuncture office in Tempe, AZ. Call Rachelle Marmor at (480) 838-1183 for a detailed description of the services offered. ",
    "Acupuncturist like Rachelle Marmor offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Rachelle Marmor for information about your acupuncture needs in Tempe, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(8 Reviews)",
  "Phone": "(480) 838-1183",
  "Address": "1127 W. Carson Drive, Tempe, AZ  85282"
}
{
  "First_and_Last_Name": "Jessica Mann, L.Ac.",
  "About": "Jessica Mann provides acupuncture in Tempe, AZ to help relieve stress and promote well-being. Jessica is dedicated to re-balancing clients' body systems through safe and effective care. Jessica spends a lot of time getting to know patients and fully understanding their needs to deliver the appropriate course of treatment. As one of the leading acupuncturists in Tempe, AZ, Jessica Mann can help alleviate a variety of health problems including pain, stress, muscular spasms, headaches, digestive issues, depression, anxiety, hypertension, allergies, sinusitis, insomnia, and more. Jessica makes the patient's health her number one concern and offers effective long-lasting relief, rather than just a quick fix. Using acupuncture, acupressure, natural herbal medicine, and personal nutrition plans, Jessica optimizes the body's healing and helps patients reclaim their energy and well-being.",
  "Services": [
    "Jessica Mann offers acupuncture in Tempe, AZ, and has helped millions of people achieve optimal health and wellness. Her therapeutic treatments incorporating Chinese herbal medicine, acupuncture, acupressure, and personal nutrition plans are customized to fit the unique needs of each client. Some of the common conditions Jessica treats include pain, stress, anxiety, allergies, depression, digestive issues, muscle spasms, headaches, insomnia, and more. Jessica gets to the core of patients' health issues, looking for any underlying issues and expertly treats each and every patient. Please call acupuncturist, Jessica Mann today to schedule a complimentary consultation and find out why so many people today are incorporating acupuncture into their health regimes. "
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "16",
  "Education": [
    "Masters Degree - Emperor's College of Traditional Oriental Medicine"
  ],
  "Training": [
    "Externship - Kerlan Jobe Orthopaedic Clinic"
  ],
  "Consumer_Feedback": "(12 Reviews)",
  "Phone": "(480) 455-9899",
  "Address": "5005 S. Ash Avenue Suite 7, Tempe, AZ  85282"
}
{
  "First_and_Last_Name": "Dagmar Bauer-Prigatano, MTOM, L.Ac.",
  "About": "Dagmar Bauer-Prigatano, MTOM, L.Ac. practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Dagmar Bauer-Prigatano, MTOM, L.Ac. is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Restorative Acupuncture Clinic at (602) 266-8332 for a detailed description of the services offered. ",
    "Acupuncturist like Dagmar Bauer-Prigatano, MTOM, L.Ac. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Restorative Acupuncture Clinic for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(3 Reviews)",
  "Phone": "(602) 266-8332",
  "Address": "202 E. Earll Drive, #420, Phoenix, AZ  85012"
}
{
  "First_and_Last_Name": "Gail Thurman",
  "About": "Gail Thurman practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Gail Thurman is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Gail Thurman at (602) 955-4321 for a detailed description of the services offered. ",
    "Acupuncturist like Gail Thurman offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Gail Thurman for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(602) 955-4321",
  "Address": "3424 East Indian Rd, Phoenix, AZ  85018"
}
{
  "First_and_Last_Name": "Wendy N Lee",
  "About": "Wendy N Lee practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Wendy N Lee is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Wendy N Lee at (480) 217-0656 for a detailed description of the services offered. ",
    "Acupuncturist like Wendy N Lee offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Wendy N Lee for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(480) 217-0656",
  "Address": "3833 E. Indian School Road, Phoenix, AZ  85018"
}
{
  "First_and_Last_Name": "Jade Jaffe, L.Ac.",
  "About": "Jade Jaffe, L.Ac. practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "Acupuncture, Oriental Medicine nutrition, Acutron (electroacupuncture, color therapy), Facial Rejuvenation",
    "Oriental Medicine"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(602) 327-3938",
  "Address": "3935 S Meadowbrook Suite 2, Phoenix, AZ  85018"
}
{
  "First_and_Last_Name": "Jordan Kopcio, DC NMD",
  "About": "We are a multi-service Wellness Center that utilizes many forms of complimentary and alternative medicine to treat our patients. We look for the deeper root cause of the illness and not just at the symptoms. We take the time to offer personalized treatment plans for each person based on their individual needs. There are many differnet therapies available: Chiropractic, Acupuncture, Cold Laser, Prolotherapy, PRP therapy, Chinese Herbal Therapy, Nutritional Counseling, and Soft Tissue Mobilization are just some of the modalities we offer to our patients.",
  "Services": [
    "Chiropractic",
    "Acupuncture",
    "Naturopathic Medicine",
    "Prolotherapy",
    "PRP therapy",
    "Sports Medicine",
    "Cold Laser",
    "Dry Needling",
    "Botox",
    "Dermal Fillers",
    "Body Contouring"
  ],
  "Primary_Specialty": "Naturopathic Doctor",
  "Practice": "10",
  "Education": [],
  "Training": [],
  "Phone": "(602) 368-5888",
  "Address": "3040 N 44th St 3, Phoenix, AZ  85018"
}
{
  "First_and_Last_Name": "John Rhodes",
  "About": "John Rhodes practices as an  Acupuncturist in Phoenix, AZ.",
  "Services": [
    "John Rhodes is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call John Rhodes at (602) 264-0694 for a detailed description of the services offered. ",
    "Acupuncturist like John Rhodes offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at John Rhodes for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(5 Reviews)",
  "Phone": "(602) 264-0694",
  "Address": "219 E Lexington Ave, Phoenix, AZ  85012"
}
{
  "First_and_Last_Name": "Daniel Smith, MD, FAEM",
  "About": "Dr. Smith is a board certified Emergency Medicine physician and certified Acupuncturist. ",
  "Services": [
    "Services provided: ",
    "- Electromyography / Nerve conduction testing",
    "- Fluoroscopic guided procedures, rest assured \"NO BLIND GUIDED PROCEDURES\". ",
    "- Ultrasound guided procedure",
    "- Epidurals",
    "- Botox injections",
    "- Radiofrequency ablations",
    "- Spinal cord stimulator trials",
    "- Trigger point injections",
    "- Platelet rich plasma therapy (PRP)",
    "- Treatment of headache pain",
    "- Viscosupplementation",
    "- All peripheral joint injections and much more....",
    "Additional Services",
    "Pain, Acupuncture, Pain management, cupping"
  ],
  "Primary_Specialty": "Pain Management Specialist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(623) 535-9777",
  "Address": "3400 N Dysart Rd. H131, Avondale, AZ  85392"
}
{
  "First_and_Last_Name": "Daniel Smith, MD, FAEM",
  "About": "Dr. Smith is a board certified Emergency Medicine physician and certified Acupuncturist. ",
  "Services": [
    "Services provided: ",
    "- Electromyography / Nerve conduction testing",
    "- Fluoroscopic guided procedures, rest assured \"NO BLIND GUIDED PROCEDURES\". ",
    "- Ultrasound guided procedure",
    "- Epidurals",
    "- Botox injections",
    "- Radiofrequency ablations",
    "- Spinal cord stimulator trials",
    "- Trigger point injections",
    "- Platelet rich plasma therapy (PRP)",
    "- Treatment of headache pain",
    "- Viscosupplementation",
    "- All peripheral joint injections and much more....",
    "Additional Services",
    "Pain, Acupuncture, Pain management, cupping"
  ],
  "Primary_Specialty": "Pain Management Specialist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(623) 535-9777",
  "Address": "3400 N Dysart Rd. H131, Avondale, AZ  85392"
}
{
  "First_and_Last_Name": "CASSANDRA LIDIN",
  "About": "CASSANDRA LIDIN practices as an  Acupuncturist in Anchorage, AK.",
  "Services": [
    "CASSANDRA LIDIN is an Acupuncturist or Acupuncture office in Anchorage, AK. Call CASSANDRA LIDIN, L.Ac at (907) 334-1965 for a detailed description of the services offered. ",
    "Acupuncturist like CASSANDRA LIDIN offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at CASSANDRA LIDIN, L.Ac for information about your acupuncture needs in Anchorage, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(907) 334-1965",
  "Address": "505 W.Northern Lights BLVD Suite 104, Anchorage, AK  99503"
}
{
  "First_and_Last_Name": "Jean Marie Bodeau",
  "About": "Jean Marie Bodeau practices as an  Acupuncturist in Anchorage, AK.",
  "Services": [
    "Jean Marie Bodeau is an Acupuncturist or Acupuncture office in Anchorage, AK. Call Jean Marie Bodeau at (907) 243-5033 for a detailed description of the services offered. ",
    "Acupuncturist like Jean Marie Bodeau offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Jean Marie Bodeau for information about your acupuncture needs in Anchorage, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(907) 243-5033",
  "Address": "1227 W 9th Ave Ste 302, Anchorage, AK  99501"
}
{
  "First_and_Last_Name": "Wanda Warren, Physical Therapist and Acupuncturist",
  "About": "Wanda Warren, Physical Therapist and Acupuncturist practices as a  Physical Therapist in Anchorage, AK.",
  "Services": [
    "Wanda Warren, Physical Therapist and Acupuncturist is a Physical Therapist/Physical Therapy office located in Anchorage, AK 99518. A Physical Therapist is trained to evaluate a patient’s need for physical intervention services and to provide such physical intervention and treatment to help the patient recover mobility that has been diminished for some reason. Possible causes for loss of mobility are sports injuries, auto accidents, work-related accidents, post-operative surgeries, falls, and strokes. A Physical Therapist’s goal when providing treatment is to greatly improve mobility and range of motion for the affected area. ",
    "Please call Wanda Warren, Physical Therapist and Acupuncturist at (907) 202-9804 to schedule an appointment in Anchorage, AK or to get more information.",
    "Craniosacral therapy"
  ],
  "Primary_Specialty": "Physical Therapist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(907) 202-9804",
  "Address": "615 E 82 Avenue, Suite B5, Anchorage, AK  99518"
}
{
  "First_and_Last_Name": "William Heath, D.C.",
  "About": "William Heath, D.C. practices as a  Chiropractor in Phoenix, AZ.",
  "Services": [
    "William Heath, D.C. practices at 2423 W. Dunlap Ave., Phoenix, AZ  85021. Chiropractors diagnose and treat common spinal misalignments that can occur from lifestyle or injuries causing pain, discomfort and degenerative conditions.",
    "William Heath, D.C. may be able to treat; back pain, sciatica, neck pain, shoulder pain, headaches, sports injuries, and auto accident injuries. ",
    "To learn more, or to make an appointment with William Heath, D.C. in Phoenix, AZ, please call (602) 249-6097 for more information.",
    "Applied Kinesiology"
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": "35",
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(602) 249-6097",
  "Address": "2423 W. Dunlap Ave., Phoenix, AZ  85021"
}
{
  "First_and_Last_Name": "Cassandra Lidin, LAc",
  "About": "5 Element Acupuncture, holistic health care.",
  "Services": [
    "The facility also provides physical therapy, naturopathy, mental health services, massage and manual therapies, yoga, and health education."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "16",
  "Education": [
    "MAc, LAc, Dipl Ac"
  ],
  "Training": [],
  "Phone": "(907) 334-1965",
  "Address": "505 West Northern Lights 104, Anchorage, AK  99503"
}
{
  "First_and_Last_Name": "Alissa M Stockton, Acupuncturist",
  "About": "Services we have at Rose Hill Wellness Center are Acupuncture, Acupuncture Facelift / Facial Rejuvenation, Oriental Medicine, Herbal Medicine, Hypnosis, Massage Therapy, Hot Stone Therapy, Tui Na Massage, Colonics, and Personal Training. ",
  "Services": [
    "$75   Acupuncture",
    "$150 Facial Rejuvenation / AC Facelift",
    "$75   Hot Stone Therapy",
    "$80   Tui Na Massage / Acupressure ",
    "$75   Colonics",
    "$65   Massage Therapy ",
    "$45   Membership unlimited fitness classes with 6 month contract",
    "$60  a month for fitness classes or martial arts class with no contract",
    "$25   Personal Training",
    "yoga, pilates, belly dance"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(928) 965-9545",
  "Address": "1059 N College Ave, Safford, AZ  85552"
}
{
  "First_and_Last_Name": "Valerie DeLaune, Licensed Acupuncturist",
  "About": "Valerie DeLaune, LAc, is a licensed acupuncturist and certified neuromuscular therapist, with a Master’s degree in acupuncture from the Northwest Institute of Acupuncture and Oriental Medicine, and a Bachelor of Science degree from the University of Washington.  She holds professional certificates from the Heartwood Institute and the Brenneke School of Massage.  ",
  "Services": [
    "Acupuncture",
    "Massage Therapy",
    "Trigger Points",
    "Myofascial Release",
    "Author of 11 Trigger Point Pain Relief books"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "31",
  "Education": [
    "Valerie DeLaune, LAc, is a licensed acupuncturist and certified neuromuscular therapist, with a Master’s degree in acupuncture from the Northwest Institute of Acupuncture and Oriental Medicine, and a Bachelor of Science degree from the University of Washington.  She holds professional certificates from the Heartwood Institute and the Brenneke School of Massage.  "
  ],
  "Training": [],
  "Phone": "(907) 435-7060",
  "Address": "3310 Arctic Blvd. 102, Anchorage, AK  99522"
}
{
  "First_and_Last_Name": "Renee Downs, Audiologist",
  "About": "Renee Downs, Audiologist practices as an  Acupuncturist in Anchorage, AK.",
  "Services": [
    "Renee Downs, Audiologist is an Acupuncturist or Acupuncture office in Anchorage, AK. Call Sound Decisions Audiology, LLC at (907) 865-3277 for a detailed description of the services offered. ",
    "Acupuncturist like Renee Downs, Audiologist offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Sound Decisions Audiology, LLC for information about your acupuncture needs in Anchorage, AK.",
    "hearing, hearing loss, hearing aids, tinnitus, auditory processing, hearing protection, swimmolds"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(907) 865-3277",
  "Address": "2522 Arctic Boulevard 100, Anchorage, AK  99503"
}
{
  "First_and_Last_Name": "Andrew    C. Wen, L.Ac. FABORM",
  "About": "Andrew    C. Wen, L.Ac. FABORM practices as an  Acupuncturist in Phoenix, AZ.He graduated from University of California Irvine & Pacific College of Oriental Medicine and has been practicing since 2003.",
  "Services": [
    "Andrew    C. Wen, L.Ac. FABORM is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Acupuncture at Anthem at (623) 680-8780 for a detailed description of the services offered. ",
    "Acupuncturist like Andrew    C. Wen, L.Ac. FABORM offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Acupuncture at Anthem for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "17",
  "Education": [
    "University of California Irvine & Pacific College of Oriental Medicine"
  ],
  "Training": [
    "Trained in U.S.& ShenZhen, China"
  ],
  "Consumer_Feedback": "(14 Reviews)",
  "Phone": "(623) 680-8780",
  "Address": "41125 Daisy Mountain Drive (Anthem), Phoenix, AZ  85086"
}
{
  "First_and_Last_Name": "David Bell, LA.c",
  "About": "Welcome to True Acupuncture, your premier Phoenix Arizona acupuncture and Traditional Chinese Medicine clinic!",
  "Services": [
    "David Bell, LA.c is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call True Acupuncture at (207) 228-4262 for a detailed description of the services offered. ",
    "Acupuncturist like David Bell, LA.c offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at True Acupuncture for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(5 Reviews)",
  "Phone": "(207) 228-4262",
  "Address": "A-, 301 Bethany Home Rd #133, Phoenix, AZ  85012"
}
{
  "First_and_Last_Name": "Jennifer Jolliffe, L.Ac.,M.Ac,Dipl.Ac.",
  "About": "Jennifer Jolliffe, L.Ac.,M.Ac,Dipl.Ac. practices as an  Acupuncturist in Anchorage, AK.",
  "Services": [
    "Jennifer Jolliffe, L.Ac.,M.Ac,Dipl.Ac. is an Acupuncturist or Acupuncture office in Anchorage, AK. Call Five Element Acupuncture at (907) 279-4300 for a detailed description of the services offered. ",
    "Acupuncturist like Jennifer Jolliffe, L.Ac.,M.Ac,Dipl.Ac. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Five Element Acupuncture for information about your acupuncture needs in Anchorage, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(7 Reviews)",
  "Phone": "(907) 279-4300",
  "Address": "Anchorage, AK  99501"
}
{
  "First_and_Last_Name": "DAVID LEGAR, Licenced Acupuncturist",
  "About": "I am a licensed and board certified acupuncturist with my Masters in Oriental Medicine. I am trained in both acupuncture and herbs, giving me an additional means to treat pain, headache/migraine, nausea, dizziness/vertigo, and OB/GYN issues with a great success rate. I have also successfully treated many other conditions, such as fatigue, insomnia, stress, and memory/concentration issues.",
  "Services": [
    "The focus of my clinic is pain management treating pain issues such as arthritis, plantar fasciitis, back pain, shoulder pain, foot pain, neck pain, hip pain, knee pain, and muscle aches. I also work with headaches, migraines, dizziness, vertigo, nausea, and OB-GYN issues.  I started practicing in May, 2013. What I love most about oriental medicine is it allows me to help people.  I love to work with patients so we can create a lifetime of health and wellness together. ",
    "Acupuncture, Oriental Medicine, Pain"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "7",
  "Education": [
    "I am a licensed acupuncturist in the State of Arizona.  I received my Masters of Science in Oriental Medicine at Phoenix Institute of Herbal Medicine and Acupuncture.  I have over three thousand hours of training in both acupuncture and herbs.  What I love most about oriental medicine is it allows me to help people.  I love to work with patients so we can create a lifetime of health and wellness together. "
  ],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(928) 274-1980",
  "Address": "5110 E. Warner Rd. Suite 201, Phoenix, AZ  85044"
}
{
  "First_and_Last_Name": "NATASHA WILLIAMS, D.C",
  "About": "Dr. Natasha Williams is a board certified sports chiropractic physician and former athlete who specializes in rehabilitation of injured athletes. She has treated collegiate athletes, mixed martial artists, power lifters, body builders and athletes from many other sports.",
  "Services": [
    "*  Physiotherapy",
    "*  Myofascial Release/Soft Tissue Mobilization",
    "*  Neuromuscular Re-education",
    "*  Chiropractic",
    "*  Massage Therapy",
    "*  Medical Acupuncture/Dry Needling",
    "*  Fascial Stretch Therapy",
    "*  Stretch to Win® Certified Fascial Stretch Therapist"
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(602) 252-0659",
  "Address": "8910 North Central Ave Suite A, Phoenix, AZ  85020"
}
{
  "First_and_Last_Name": "Scott Anderson, L.A.C., L.C.H.",
  "About": "Scott Anderson, L.A.C., L.C.H. practices as an  Acupuncturist in Phoenix, AZ.He graduated from Phoenix Institute of Herbal Medicine & Acupuncture and has been practicing since 2002.",
  "Services": [
    "Scott Anderson, L.A.C., L.C.H. is an Acupuncturist or Acupuncture office in Phoenix, AZ. Call Verde Medicine at (480) 277-9003 for a detailed description of the services offered. ",
    "Acupuncturist like Scott Anderson, L.A.C., L.C.H. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Verde Medicine for information about your acupuncture needs in Phoenix, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "18",
  "Education": [
    "Phoenix Institute of Herbal Medicine & Acupuncture"
  ],
  "Training": [
    "Currently Herbal Chair at PIHMA and on staff at Banner Good Samaritan.  Also on the teaching staff of PIHMA"
  ],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(480) 277-9003",
  "Address": "Phoenix, AZ  85022"
}
{
  "First_and_Last_Name": "Rande Lucas",
  "About": "Rande Lucas practices as an  Acupuncturist in Anchorage, AK.",
  "Services": [
    "Rande Lucas is an Acupuncturist or Acupuncture office in Anchorage, AK. Call Rande Lucas at (907) 272-0007 for a detailed description of the services offered. ",
    "Acupuncturist like Rande Lucas offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Rande Lucas for information about your acupuncture needs in Anchorage, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(907) 272-0007",
  "Address": "900 West Fireweed Lane Suite 201, Anchorage, AK  99503"
}
{
  "First_and_Last_Name": "Sy Cloud, Acupuncturist, pending lic",
  "About": "License pending National Board Certification.",
  "Services": [
    "Sy Cloud, Acupuncturist, pending lic is an Acupuncturist or Acupuncture office in Anchorage, AK. Call Sy Cloud Acupuncturist at (907) 350-1595 for a detailed description of the services offered. ",
    "Acupuncturist like Sy Cloud, Acupuncturist, pending lic offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Sy Cloud Acupuncturist for information about your acupuncture needs in Anchorage, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(3 Reviews)",
  "Phone": "(907) 350-1595",
  "Address": "Anchorage Area, Anchorage, AK  99501"
}
{
  "First_and_Last_Name": "Kevin Meddleton, M.Ac.,L.Ac.",
  "About": "Kevin Meddleton, M.Ac.,L.Ac. practices as an  Acupuncturist in Palmer, AK.He graduated from Traditional Acupuncture Institute and has been practicing since 2003.",
  "Services": [
    "Kevin Meddleton, M.Ac.,L.Ac. is an Acupuncturist or Acupuncture office in Palmer, AK. Call Alaska Center for Acupuncture at (907) 745-8688 for a detailed description of the services offered. ",
    "Acupuncturist like Kevin Meddleton, M.Ac.,L.Ac. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Alaska Center for Acupuncture for information about your acupuncture needs in Palmer, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "17",
  "Education": [
    "Traditional Acupuncture Institute"
  ],
  "Training": [
    "Masters of Acupuncture, Traditional Acupuncture Institute, Laurel, MD"
  ],
  "Phone": "(907) 745-8688",
  "Address": "642 S. Alaska St. Ste. 208, Palmer, AK  99645"
}
{
  "First_and_Last_Name": "Samantha Berg, M.Ac.,L.Ac.",
  "About": "Samantha Berg, M.Ac.,L.Ac. practices as an  Acupuncturist in Palmer, AK.She graduated from Traditional Acupuncture Institute and has been practicing since 2003.",
  "Services": [
    "Samantha Berg, M.Ac.,L.Ac. is an Acupuncturist or Acupuncture office in Palmer, AK. Call Alaska Center for Acupuncture at (907) 745-8688 for a detailed description of the services offered. ",
    "Acupuncturist like Samantha Berg, M.Ac.,L.Ac. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Alaska Center for Acupuncture for information about your acupuncture needs in Palmer, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "17",
  "Education": [
    "Traditional Acupuncture Institute"
  ],
  "Training": [
    "Masters of Acupuncture, Traditional Acupuncture Institute, Laurel, MD"
  ],
  "Phone": "(907) 745-8688",
  "Address": "642 S. Alaska St. Ste. 208, Palmer, AK  99645"
}
{
  "First_and_Last_Name": "Ron Lieberman, DC",
  "About": "Ron Lieberman, DC practices as a  Chiropractor in Rogers, AR.",
  "Services": [
    "Ron Lieberman, DC practices at 1100 Mallard Pl Suite A, Rogers, AR  72756. Chiropractors diagnose and treat common spinal misalignments that can occur from lifestyle or injuries causing pain, discomfort and degenerative conditions.",
    "Ron Lieberman, DC may be able to treat; back pain, sciatica, neck pain, shoulder pain, headaches, sports injuries, and auto accident injuries. ",
    "To learn more, or to make an appointment with Ron Lieberman, DC in Rogers, AR, please call (479) 271-0000 for more information."
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": "20",
  "Education": [],
  "Training": [],
  "Phone": "(479) 271-0000",
  "Address": "1100 Mallard Pl Suite A, Rogers, AR  72756"
}
{
  "First_and_Last_Name": "ALISSA STOCKTON, manager",
  "About": "Rose Hill Wellness offers Acupuncture, Massage, Hypnosis, Personal Training, Fitness Classes, Yoga, Pilates, Belly Dance, hOOping, World Fusion Dance, and Martial Arts. ",
  "Services": [
    "We offer Acupuncture, Massage Therapy, and Hypnosis",
    "We also offer fitness classes in Yoga, Pilates, Belly Dance, World Fusion Dance, hOOping, Physioball, Tae kwon Do, and MMA.",
    "Community Acupuncture Clinic M-TH, 1:00 pm to 4:00 pm, $25 a treatment",
    "Massage therapy 1 hour $65",
    "Fitness classes $50 a month with 6 month contract",
    "Acupuncture, Massage, Yoga, Pilates, Belly Dance, Tae Kwon Do, Martial Arts"
  ],
  "Primary_Specialty": "Yoga Teacher",
  "Practice": null,
  "Education": [
    "Master of Science, Oriental Medicine",
    "Sports Medicine and Rehabilitation ",
    "Secondary Education",
    "Personal Training",
    "Yoga Instructor",
    "Pilates Instructor",
    "Chi Gong Instructor",
    "Taekwondo Instructor"
  ],
  "Training": [
    "Our instructors have formal training in Acupuncture, Oriental Medicine, Massage Therapy, Secondary Education, Sports Medicine & Rehab, Chi Gong, Yoga, Pilates, Group fitness instruction, Personal Training."
  ],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(928) 965-9545",
  "Address": "1059 N College Ave, Thatcher, AZ  85552"
}
{
  "First_and_Last_Name": "Jiang Liu",
  "About": "Jiang Liu practices as an  Acupuncturist in Little Rock, AR.",
  "Services": [
    "Jiang Liu is an Acupuncturist or Acupuncture office in Little Rock, AR. Call Jiang Liu at (501) 661-0336 for a detailed description of the services offered. ",
    "Acupuncturist like Jiang Liu offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Jiang Liu for information about your acupuncture needs in Little Rock, AR."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(501) 661-0336",
  "Address": "701 North University Ave,  Suite 101, Little Rock, AR  72205"
}
{
  "First_and_Last_Name": "Ronald S. Yow, D.C.",
  "About": "We are a wellness clinic that specializes in back pain, neck pain, headaches and sciatica. We have been in the same location since March 2002. Dr. Yow has been a practicing chiropractor for the past 23 years. ",
  "Services": [
    "Dr. Yow uses diversified, drop table and instrument adjusting techniques. He also uses trigger point therapy and acupressure points. He is also licensed to practice acupuncture. Dr. Yow also specializes in Non-surgical Spinal Decompression therapy and low-level laser therapy. ",
    "Chiropractic/Acupuncture"
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": "23",
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(870) 994-7550",
  "Address": "121 HWY 62W, ASH FLAT, AR  72513"
}
{
  "First_and_Last_Name": "Julie Rae",
  "About": "Julie Rae practices as an  Acupuncturist in Glendale, AZ.",
  "Services": [
    "Julie Rae is an Acupuncturist or Acupuncture office in Glendale, AZ. Call Julie Rae at (623) 937-1560 for a detailed description of the services offered. ",
    "Acupuncturist like Julie Rae offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Julie Rae for information about your acupuncture needs in Glendale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(623) 937-1560",
  "Address": "5750 West Glendale Ave, Glendale, AZ  85305"
}
{
  "First_and_Last_Name": "John Galloway, Owner",
  "About": "At Galloway Therapy our goal is to provide physical therapy services in a comfortable environment helping patients to exceed their expectations, achieve goals, and return to their highest function possible. At our new state-of-the-art facility, our staff strives for excellence by providing professional, compassionate care via innovative treatment plans to meet our patient’s needs.",
  "Services": [
    "John Galloway, Owner is a Physical Therapist/Physical Therapy office located in North Little Rock, AR 72117. A Physical Therapist is trained to evaluate a patient’s need for physical intervention services and to provide such physical intervention and treatment to help the patient recover mobility that has been diminished for some reason. Possible causes for loss of mobility are sports injuries, auto accidents, work-related accidents, post-operative surgeries, falls, and strokes. A Physical Therapist’s goal when providing treatment is to greatly improve mobility and range of motion for the affected area. ",
    "Please call John Galloway, Owner at (501) 319-7659 to schedule an appointment in North Little Rock, AR or to get more information."
  ],
  "Primary_Specialty": "Physical Therapist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(501) 319-7659",
  "Address": "4624 E 43rd St, North Little Rock, AR  72117"
}
{
  "First_and_Last_Name": "Daniel James Young",
  "About": "Daniel James Young practices as an  Acupuncturist in Eagle River, AK.",
  "Services": [
    "Daniel James Young is an Acupuncturist or Acupuncture office in Eagle River, AK. Call Daniel James Young at (907) 694-5522 for a detailed description of the services offered. ",
    "Acupuncturist like Daniel James Young offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Daniel James Young for information about your acupuncture needs in Eagle River, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(907) 694-5522",
  "Address": "10928 Eagle River Road - 254, Eagle River, AK  99577"
}
{
  "First_and_Last_Name": "Michael Wedge, L.Ac., M.Ac.O.M., DCH",
  "About": "I have been in practice since 1992 and specialize in the treatment of pain and injuries as well as women's health.  I utilize a variety of treatments, including acupuncture and non acupuncture approaches as well as nutritional and herbal medicine.  ",
  "Services": [
    "Michael Wedge, L.Ac., M.Ac.O.M., DCH is an Acupuncturist or Acupuncture office in Palmer, AK. Call Premier Acupuncture & Complementary Medicine, Inc. at (907) 745-7928 for a detailed description of the services offered. ",
    "Acupuncturist like Michael Wedge, L.Ac., M.Ac.O.M., DCH offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Premier Acupuncture & Complementary Medicine, Inc. for information about your acupuncture needs in Palmer, AK."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "28",
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(5 Reviews)",
  "Phone": "(907) 745-7928",
  "Address": "1901 N Hemmer Road Suite 211, Palmer, AK  99645"
}
{
  "First_and_Last_Name": "Martin Eisele",
  "About": "Martin Eisele practices as an  Acupuncturist in Little Rock, AR.",
  "Services": [
    "Martin Eisele is an Acupuncturist or Acupuncture office in Little Rock, AR. Call Martin Eisele at (501) 663-3461 for a detailed description of the services offered. ",
    "Acupuncturist like Martin Eisele offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Martin Eisele for information about your acupuncture needs in Little Rock, AR."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(501) 663-3461",
  "Address": "2 Van Circle Suite 1, Little Rock, AR  72207"
}
{
  "First_and_Last_Name": "Wil McCauley, DC",
  "About": "$35.00 Treatment Sessions",
  "Services": [
    "Wil McCauley, DC practices at 2928 N McKee Circle  101, Fayetteville, AR  72703. Chiropractors diagnose and treat common spinal misalignments that can occur from lifestyle or injuries causing pain, discomfort and degenerative conditions.",
    "Wil McCauley, DC may be able to treat; back pain, sciatica, neck pain, shoulder pain, headaches, sports injuries, and auto accident injuries. ",
    "To learn more, or to make an appointment with Wil McCauley, DC in Fayetteville, AR, please call (479) 879-3366 for more information."
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": "12",
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(4 Reviews)",
  "Phone": "(479) 879-3366",
  "Address": "2928 N McKee Circle  101, Fayetteville, AR  72703"
}
{
  "First_and_Last_Name": "Leslie Gray, L.Ac",
  "About": "Providing Quality Community Acupuncture in West Phoenix, Glendale, Peoria. Surprise, Sun City area. Cupping,  Moxa, Electro-acupuncture, Massage, Float Spa, CBD products and best ways to regain your health. ",
  "Services": [
    "The Acupuncture Healing Center provides pain management in Glendale, AZ. A Pain Management Specialist is a physician who has four extra years learning anesthesiology and pain medicine to help patients with pain management.",
    "Please call Leslie Gray, L.Ac at (480) 843-7050 to schedule an appointment in Glendale, AZ or to get more information.",
    "acupuncture near me, cupping near me, "
  ],
  "Primary_Specialty": "Pain Management Specialist",
  "Practice": "12",
  "Education": [
    "South Baylo University Anaheim, CA, Emperor's College Of Traditional Medicine Santa Monica, CA, Being International Acupuncture Center Beijing, China"
  ],
  "Training": [],
  "Phone": "(480) 843-7050",
  "Address": "4358 W Thunderbird Rd , Glendale, AZ  85306"
}
{
  "First_and_Last_Name": "George E Hibner",
  "About": "George E Hibner practices as an  Acupuncturist in Peoria, AZ.",
  "Services": [
    "George E Hibner is an Acupuncturist or Acupuncture office in Peoria, AZ. Call George E Hibner at (623) 334-5010 for a detailed description of the services offered. ",
    "Acupuncturist like George E Hibner offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at George E Hibner for information about your acupuncture needs in Peoria, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(623) 334-5010",
  "Address": "15182 N. 75th Ave #160, Peoria, AZ  85381"
}
{
  "First_and_Last_Name": "Pamela Bayers, LAc",
  "About": "Pamela Bayers, LAc practices as an  Acupuncturist in Fayetteville, AR.",
  "Services": [
    "We provide Acupuncture, Chinese Herbs, Traditional Chinese Medicine and Oriental Reproductive Medicine. We treat Pain, Immune Disorders, and Reproductive Disorders."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(479) 582-3300",
  "Address": "2400 Wedington, Drive, Fayetteville, AR  72701"
}
{
  "First_and_Last_Name": "Dr. Ellie Wright, NMD",
  "About": "Dr. Ellie Wright, NMD is a naturopathic doctor in Glendale, AZ. Her purpose is to provide personalized service and natural medicine. She has been trained and licensed to practice both allopathic and naturopathic medicine. Dr Wright works with her own line of supplements that are aiming to support cholesterol, digestion issue, diabetes, thyroid, hormones, sleep, mental health, bone health. She loves to use plants, micronutrients and amino acids to balance neurotransmitters and hormones.",
  "Services": [
    "Oral chelation",
    "Detox",
    "Hypertension",
    "Diabetes",
    "Weight loss",
    "Hormone balance",
    "Mental Health",
    "Digestive issue",
    "Autoimmune",
    "Pre/Post Cancer ",
    "Thyroid",
    "Bone health",
    "Cholesterol",
    "holistic medicine, naturopathic medicine,  cholesterol, digestion issue, diabetes, thyroid, hormones, sleep, mental health, bone health"
  ],
  "Primary_Specialty": "Naturopathic Doctor",
  "Practice": null,
  "Education": [
    "Dr. Ellie Wright graduated with honors from the Arizona State University with a Bachelor degree and Master of Arts. Next she earned a grad level Certificate in Geriatric and Gerontology from Arizona State University. She continued her education at the Southwest College of Naturopathic Medicine in Tempe, Arizona where she graduated with Doctoral Degree in Naturopathic Medicine. "
  ],
  "Training": [],
  "Phone": "(623) 734-2473",
  "Address": "17505 N 79th Ave  213/I, Glendale, AZ  85308"
}
{
  "First_and_Last_Name": "Ruqing Xie",
  "About": "Ruqing Xie practices as an  Acupuncturist in Scottsdale, AZ.",
  "Services": [
    "Ruqing Xie is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Ruqing Xie at (480) 946-5626 for a detailed description of the services offered. ",
    "Acupuncturist like Ruqing Xie offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Ruqing Xie for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 946-5626",
  "Address": "2401 N, Hayden Rd, Suite 108, Scottsdale, AZ  85257"
}
{
  "First_and_Last_Name": "Pamela Bayers, LAc, MSOM, DipOM,CH,Ac,FABORM",
  "About": "At Acupuncture of NW Arkansas, Health and Harmony Oriental Medical Clinic, people come for help for their health problems after they have tried many other modalites for treatment. In a short amount of time, they are on their way to feeling better. We use acupuncture, Chinese herbology and other Asian healing arts to help the body recover from illness and/or pain. Pamela Bayers, acupuncturist, specializes in Acute and Chronic Pain, Infertility and Autoimmune conditions, however, there are many other conditions which she has successfully treated. These include but are not limited to: Women's Health, Anxiety, Depression, PTSD, Stroke,Nerve Disorders, Sports Injury, Allergies, Asthma, COPD, Facial Rejuvenation, Weight control, Fatigue, Insomnia, Digestive, Smoking / Addictions, Urinary.",
  "Services": [
    "The acupuncturist, Pamela Bayers, combines many different treatment styles of acupuncture for highly effective results. Many times after only 1 to 2 treatments people are on the road to recovery. Pamela has studied with some of the most accomplished acupuncturists and herbalists in the world, including: Kiiko Matsumato, Dr. Richard Teh-Fu Tan, John Chen, Elisabet Stener-Victorin, Jane Lyttleton, Jeffery Yuen, , Dongxin Ma,  Brandon Horn, Claudia Citkovitz, Dr. Jake Paul Fratkin and many others. She attends 150 to 200 hours of classes a year to stay on top of Asian medical arts. She spends anywhere from 1 to 2 hours with a patient to help resolve their problems.",
    "Pain, Fertility, Immune, Women's Health, Anxiety, Depression, stroke"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(15 Reviews)",
  "Phone": "(479) 582-3300",
  "Address": "2400 Wedington, Fayetteville, AR  72701"
}
{
  "First_and_Last_Name": "Phoenix Rising Acupuncture And Oriental Medicine College",
  "About": "Phoenix Rising Acupuncture And Oriental Medicine College is a Acupuncturist facility at 8370 E Viaduct De Ventura Bldg K 100 in Scottsdale, AZ.",
  "Services": [
    "Phoenix Rising Acupuncture And Oriental Medicine College is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Phoenix Rising Acupuncture And Oriental Medicine College at (480) 990-1021 for a detailed description of the services offered. ",
    "Acupuncturist like Phoenix Rising Acupuncture And Oriental Medicine College offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Phoenix Rising Acupuncture And Oriental Medicine College for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 990-1021",
  "Address": "8370 E Viaduct De Ventura Bldg K 100, Scottsdale, AZ  85258"
}
{
  "First_and_Last_Name": "Allen Sherman, DPM, LAC.",
  "About": "Allen Sherman, DPM, LAC. practices as an  Acupuncturist in Scottsdale, AZ.",
  "Services": [
    "Allen Sherman, DPM, LAC. is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Allen Sherman, DPM, LAC. at (602) 478-5495 for a detailed description of the services offered. ",
    "Acupuncturist like Allen Sherman, DPM, LAC. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Allen Sherman, DPM, LAC. for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(602) 478-5495",
  "Address": "8051 E Del Acero Dr, Scottsdale, AZ  85258"
}
{
  "First_and_Last_Name": "The Flow of Life Acupuncture Clinic",
  "About": "The Flow of Life Acupuncture Clinic is a Acupuncturist facility at 8390 E. Via De Ventura Suite F114 in Scottsdale, AZ.",
  "Services": [
    "The Flow of Life Acupuncture Clinic is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call The Flow of Life Acupuncture Clinic at (480) 998-7501 for a detailed description of the services offered. ",
    "Acupuncturist like The Flow of Life Acupuncture Clinic offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at The Flow of Life Acupuncture Clinic for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 998-7501",
  "Address": "8390 E. Via De Ventura Suite F114, Scottsdale, AZ  85258"
}
{
  "First_and_Last_Name": "Qiaoli Lei, Dipl.O.M., L.Ac.",
  "About": "QiaoliLei has30 years experience, 5th generation acupuncturist. NCCAOM certified acupuncturist and herbologist. AR state licensed. sucessfully treated more then ten thousands patients in headach, depression, anxiety, digestion disorder, constipation,",
  "Services": [
    "Chinese medicine, Acupuncture, Cupping, Nutrition consulting.Guasha."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(501) 312-9888",
  "Address": "2723 Foxcroft Rd, Suite 103, Little Rock, AR  72227"
}
{
  "First_and_Last_Name": "Toni Bennalley",
  "About": "Toni Bennalley practices as an  Acupuncturist in Glendale, AZ.",
  "Services": [
    "Toni Bennalley is an Acupuncturist or Acupuncture office in Glendale, AZ. Call Toni Bennalley at (623) 204-5604 for a detailed description of the services offered. ",
    "Acupuncturist like Toni Bennalley offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Toni Bennalley for information about your acupuncture needs in Glendale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(4 Reviews)",
  "Phone": "(623) 204-5604",
  "Address": "5750 W. Glendale, Glendale, AZ  85301"
}
{
  "First_and_Last_Name": "Jill O'Brien",
  "About": "Jill O'Brien practices as an  Acupuncturist in Peoria, AZ.",
  "Services": [
    "Jill O'Brien is an Acupuncturist or Acupuncture office in Peoria, AZ. Call Jill O'Brien at (623) 933-1763 for a detailed description of the services offered. ",
    "Acupuncturist like Jill O'Brien offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Jill O'Brien for information about your acupuncture needs in Peoria, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(623) 933-1763",
  "Address": "13660 N 94th Dr., Ste C-1, Peoria, AZ  85381"
}
{
  "First_and_Last_Name": "Laurie Perez",
  "About": "Laurie Perez practices as an  Acupuncturist in Scottsdale, AZ.",
  "Services": [
    "Laurie Perez is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Laurie Perez at (480) 862-6641 for a detailed description of the services offered. ",
    "Acupuncturist like Laurie Perez offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Laurie Perez for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 862-6641",
  "Address": "16211 N Scottsdale Rd #457, Scottsdale, AZ  85254"
}
{
  "First_and_Last_Name": "Rachelle Marmor",
  "About": "Rachelle Marmor practices as an  Acupuncturist in Scottsdale, AZ.",
  "Services": [
    "Rachelle Marmor is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Rachelle Marmor at (480) 596-9600 for a detailed description of the services offered. ",
    "Acupuncturist like Rachelle Marmor offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Rachelle Marmor for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 596-9600",
  "Address": "10613 N. Hayden Rd., Ste. J-103, Scottsdale, AZ  85260"
}
{
  "First_and_Last_Name": "Acupuncture & Chinese Herbs",
  "About": "Acupuncture & Chinese Herbs is a Acupuncturist facility at 3080 N Civic Center Plz in Scottsdale, AZ.",
  "Services": [
    "Acupuncture & Chinese Herbs is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Acupuncture & Chinese Herbs at (480) 946-5626 for a detailed description of the services offered. ",
    "Acupuncturist like Acupuncture & Chinese Herbs offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Acupuncture & Chinese Herbs for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 946-5626",
  "Address": "3080 N Civic Center Plz, Scottsdale, AZ  85251"
}
{
  "First_and_Last_Name": "Joshuah Kim",
  "About": "Joshuah Kim practices as an  Acupuncturist in Scottsdale, AZ.",
  "Services": [
    "Joshuah Kim is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Joshuah Kim at (480) 730-4991 for a detailed description of the services offered. ",
    "Acupuncturist like Joshuah Kim offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Joshuah Kim for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 730-4991",
  "Address": "7742 Thomas Road, Scottsdale, AZ  85251"
}
{
  "First_and_Last_Name": "Michele Mutascio, L.Ac.,MSOM,Dipl.OM,B.A.Psych",
  "About": "Michele Mutascio, L.Ac.,MSOM,Dipl.OM,B.A.Psych practices as an  Acupuncturist in Scottsdale, AZ.She graduated from Phoenix  Institute of Herbal Medicine and Acupuncture and has been practicing since 2005.",
  "Services": [
    "Michele Mutascio, L.Ac.,MSOM,Dipl.OM,B.A.Psych is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call The Flow of Life Acupuncture Clinic at (602) 380-4995 for a detailed description of the services offered. ",
    "Acupuncturist like Michele Mutascio, L.Ac.,MSOM,Dipl.OM,B.A.Psych offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at The Flow of Life Acupuncture Clinic for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "15",
  "Education": [
    "Phoenix  Institute of Herbal Medicine and Acupuncture"
  ],
  "Training": [
    "Masters of Oriental Medicine, P.I.H.M.A",
    "Chengdu University of Traditional Chinese Medicine, Chengdu, China"
  ],
  "Phone": "(602) 380-4995",
  "Address": "3301 N Miller Rd., Studio Two, Scottsdale, AZ  85251"
}
{
  "First_and_Last_Name": "Alaina Speraw, L.Ac.,Dipl.Ac.,B.A.",
  "About": "Alaina Speraw, L.Ac.,Dipl.Ac.,B.A. practices as an  Acupuncturist in Scottsdale, AZ.She graduated from Sonoma State University, Rohnert Park CA and has been practicing since 1989.",
  "Services": [
    "Alaina Speraw, L.Ac.,Dipl.Ac.,B.A. is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Alaina Speraw, L.Ac.,Dipl.Ac.,B.A. at (480) 710-8458 for a detailed description of the services offered. ",
    "Acupuncturist like Alaina Speraw, L.Ac.,Dipl.Ac.,B.A. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Alaina Speraw, L.Ac.,Dipl.Ac.,B.A. for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "31",
  "Education": [
    "Sonoma State University, Rohnert Park CA"
  ],
  "Training": [
    "Emperor's College of Traditional Oriental Medicine Santa Monica CA"
  ],
  "Phone": "(480) 710-8458",
  "Address": "8424 E Shea Blvd Ste 100, Scottsdale, AZ  85258"
}
{
  "First_and_Last_Name": "Karla Sourasky Olmos, L. A.c.",
  "About": "Alivia Acupuncture Clinic is a holistic clinic that considers the person as a whole (body, mind and spirit) whose quest is optimal health and wellness. Imbalances in our physical, emotional or spiritual parts can impact negatively our overall health. In Alivia Acupuncture Clinic we look for potential factors that can cause imbalances such as: medical problems, poor diet, unhealthy sleep habits and stress and we treat the root of the issue with the aim of achieving wellness.",
  "Services": [
    "Alivia Acupuncture Clinic encompasses a comprehensive list of techniques such as moxibustion, cupping, gua sha, electro acupuncture and Chinese nutritional counselling making them available to help you on this journey. We specialize in the treatment of chronic and acute conditions such as pain, infertility, woman’s health, stress relief, anxiety, insomnia, skin, joint and respiratory problems, in addition to others."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 243-2453",
  "Address": "1412 N. Scottsdale Rd., Scottsdale, AZ  85257"
}
{
  "First_and_Last_Name": "Dr. Jodine L. Wamsley, DAOM, MS, L.Ac.",
  "About": "BIOGRAPHY",
  "Services": [
    "Acupuncture",
    "Chinese Herbs",
    "Nutrition",
    "acupuncture herbs nutrition pain neurological digestive disorders"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 718-5840",
  "Address": "9815 E. Bell Road Suite 110 110, Scottsdale, AZ  85260"
}
{
  "First_and_Last_Name": "Pamela Wake, L.Ac.",
  "About": "Evolution Acupuncture, LLC provides acupuncture services in Scottsdale and surrounding cities for pain, stress, and other chronic, hard to resolve health concerns.",
  "Services": [
    "Consultation and 1-hour treatment, workplace wellness, herbs and lifestyle counseling.",
    "Workplace Wellness"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(602) 535-5486",
  "Address": "9815 E. Bell Road 110, Scottsdale, AZ  85260"
}
{
  "First_and_Last_Name": "Courtney S. O'Brien",
  "About": "Courtney S. O'Brien practices as an  Acupuncturist in Scottsdale, AZ.",
  "Services": [
    "Courtney S. O'Brien is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Courtney S. O'Brien at (480) 730-4991 for a detailed description of the services offered. ",
    "Acupuncturist like Courtney S. O'Brien offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Courtney S. O'Brien for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(480) 730-4991",
  "Address": "7742 E. Thomas Road, Scottsdale, AZ  85251"
}
{
  "First_and_Last_Name": "Diana DaGrosa, MSOM, L.Ac., ACN",
  "About": "Diana L. DaGrosa, MSOM, L.Ac., ACN specializing in Integrating Functional Medicine, Applied Clinical Nutrition, Cytokine Therapy, Traditional Asian Medicine including Acupuncture and Functional Laboratory Test Assessments to Quickly, Effectively and Positively Impact Patient's Health and Wellness.  She has practiced Functional Nutrition for over 25 years and has been a Licensed Acupuncturist since 2005.  She has a Masters of Chinese Medicine, is an Applied Clinical Nutritionist, is a NCCAOM Diplomate of Acupuncture, and has a Bachelors of Science in Health and Exercise.  She is also a Candidate for Certification with the The Institute for Functional Medicine.",
  "Services": [
    "Acupuncture",
    "Functional Medicine",
    "Blood Chemistry Assessments using Functional Levels",
    "Clinical Nutrition",
    "Targeted Nutrient Therapy",
    "Cytokine Therapy",
    "Low Level Laser Light Therapy",
    "Laser Acupuncture",
    "Diana L. DaGrosa, MSOM, L.Ac., ACN",
    "Bright Path Wellness, Inc",
    "8701 E. Vista Bonita Drive, Suite 110",
    "Scottsdale, AZ  85255",
    "480-629-8110",
    "Acupuncture & Functional Medicine"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "16",
  "Education": [
    "NCCAOM Diplomate of Acupuncture",
    "Masters of Science in Oriental Medicine",
    "Applied Clinical Nutritionist",
    "Bachelors of Science in Health & Exercise"
  ],
  "Training": [],
  "Phone": "(480) 629-8110",
  "Address": "8701 E. Vista Bonita Drive Suite 110, Scottsdale, AZ  85255"
}
{
  "First_and_Last_Name": "Pei Jung Kuo, L Ac",
  "About": "Pei Jung Kuo L.Ac. graduated from China Medical University in 1996, (seven-years medical school ). She has achieved both entire Oriental and Western medicine education, and practiced Chinese medicine over 20 years. She  practiced traditional Chinese medicine in Tzu Chi Hospital (the greatest Buddhist Hospital in Taiwan).",
  "Services": [
    "In our treating session: pulse reading, tongue diagnosis, diet suggestion are all available and included. According to individual need, we offer: Acupuncture, Chinese herbal formula, Cupping therapy, Face lift and Bell firming, Cosmetic acupuncture, Infrared light treatment, Electric stimulation, Auricular(ear) acupuncture, Post-surgery and post-chemotherapy regulation, Pain relief and stress reduction.",
    "We believe that everyone has potential to prevent and reverse the disease. Our mission is to help you achieve your best potential. Besides, we're pleased to provide a convenient and affordable environment for you to experience a better life. ",
    "acupuncture, Chinese herbal medicine"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [
    "School of Chinese Medicine, China Medical University, Taichung, Taiwan "
  ],
  "Training": [
    "Traditional Chinese Medical Center of China Medical University Hospital in Taichung, Taiwan for 2 years and Hualien Tzu Chi Hospital in Hualien, Taiwan for 2 years"
  ],
  "Phone": "(480) 588-6707",
  "Address": "9393 N 90th St  Ste 118, Scottsdale, AZ  85258"
}
{
  "First_and_Last_Name": "Jennifer L. Jacoby",
  "About": "Jennifer L. Jacoby practices as an  Acupuncturist in Scottsdale, AZ.",
  "Services": [
    "Jennifer L. Jacoby is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Jennifer L. Jacoby at (480) 368-7006 for a detailed description of the services offered. ",
    "Acupuncturist like Jennifer L. Jacoby offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Jennifer L. Jacoby for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(480) 368-7006",
  "Address": "14300 N. Northsight Blvd, Suite 209, Scottsdale, AZ  85260"
}
{
  "First_and_Last_Name": "Kathleen Burke",
  "About": "Kathleen Burke practices as an  Acupuncturist in Scottsdale, AZ.",
  "Services": [
    "Japanese Meridian Therapy",
    "Toyohari",
    "Cupping",
    "Traditional Chinese Acupuncture"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(480) 382-9510",
  "Address": "3301 N Miller Rd  #13, Scottsdale, AZ  85251"
}
{
  "First_and_Last_Name": "Lance Donatello",
  "About": "Lance Donatello practices as an  Acupuncturist in Scottsdale, AZ.",
  "Services": [
    "Lance Donatello is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Lance Donatello at  for a detailed description of the services offered. ",
    "Acupuncturist like Lance Donatello offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Lance Donatello for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": null,
  "Address": "8390 E. Via De Ventura, Suite F204, Scottsdale, AZ  85258"
}
{
  "First_and_Last_Name": "Lea Inoue",
  "About": "Lea Inoue practices as an  Acupuncturist in Scottsdale, AZ.",
  "Services": [
    "Lea Inoue is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Lea Inoue at (480) 612-5007 for a detailed description of the services offered. ",
    "Acupuncturist like Lea Inoue offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Lea Inoue for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(480) 612-5007",
  "Address": "8140 E Cactus Rd Suite 720 B, Scottsdale, AZ  85260"
}
{
  "First_and_Last_Name": "Dana Price, Dr.",
  "About": "Dana Price, Dr. practices as an  Acupuncturist in Scottsdale, AZ.She graduated from International Institute of Chinese Medicine and has been practicing since 1999.",
  "Services": [
    "Dana Price, Dr. is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Dana Price, Dr. at (602) 957-2602 for a detailed description of the services offered. ",
    "Acupuncturist like Dana Price, Dr. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Dana Price, Dr. for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "21",
  "Education": [
    "International Institute of Chinese Medicine"
  ],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(602) 957-2602",
  "Address": "7520 E Camelback Rd, Scottsdale, AZ  85251"
}
{
  "First_and_Last_Name": "Woohyung Cho",
  "About": "Woohyung Cho practices as an  Acupuncturist in Scottsdale, AZ.",
  "Services": [
    "Woohyung Cho is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Woohyung Cho at (480) 551-0808 for a detailed description of the services offered. ",
    "Acupuncturist like Woohyung Cho offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Woohyung Cho for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(480) 551-0808",
  "Address": "10752 N. 89th Pl., Ste.#227, Scottsdale, AZ  85260"
}
{
  "First_and_Last_Name": "Marie Yahner",
  "About": "Marie Yahner practices as an  Acupuncturist in Scottsdale, AZ.",
  "Services": [
    "Marie Yahner is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call Marie Yahner at (602) 721-0644 for a detailed description of the services offered. ",
    "Acupuncturist like Marie Yahner offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Marie Yahner for information about your acupuncture needs in Scottsdale, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(3 Reviews)",
  "Phone": "(602) 721-0644",
  "Address": "9832 N. Hayden Rd., Suite 215, Scottsdale, AZ  85258"
}
{
  "First_and_Last_Name": "Robert Koagedal, Founder CEO",
  "About": "AcuHealth is a full service holistic health center treating many of today's chronic health concerns using Traditional Chinese Medicine with functional and integrative theories to create a truly comprehensive medicine.",
  "Services": [
    "Robert Koagedal, Founder CEO is an Acupuncturist or Acupuncture office in Scottsdale, AZ. Call AcuHealth at (480) 477-7722 for a detailed description of the services offered. ",
    "Acupuncturist like Robert Koagedal, Founder CEO offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at AcuHealth for information about your acupuncture needs in Scottsdale, AZ.",
    "Women's Health, Infertility, Digestive Health"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(4 Reviews)",
  "Phone": "(480) 477-7722",
  "Address": "8591 E. Bell Rd #103, Scottsdale, AZ  85260"
}
{
  "First_and_Last_Name": "Kevin Turley, D.C.",
  "About": "Dr. Kevin B. Turley owns and operates Turley Chiropractic, a sports and wellness chiropractic office located in south Scottsdale at 1920 N. Scottsdale Road, Scottsdale, AZ, 85257. He has been practicing for 12+ years and treats sports injuries, auto accidents, work injuries, as well as a variety of musculoskeletal conditions including spinal, pelvic and extremity (shoulder, elbow, wrist, hand, hip, knee, ankle, foot) pain. He has served as the official chiropractor for Arizona State University athletics  for over 10 years, including the team chiropractor for ASU football.  Additionally, he has worked with the Arizona Cardinals football team, as well as professional golfers, baseball and basketball players.   ",
  "Services": [
    "As a sports and wellness center, Dr. Kevin B. Turley at Turley Chiropractic routinely treats spinal and extremity pain/injuries. Some common ailments include arthritis, degenerative disc disease, pinched discs, disc bulges/herniations, muscle spasms, sciatica, nerve impingements, thoracic outlet syndrome, carpal tunnel, tennis/golfers elbow, frozen shoulder, rotator cuff conditions, hip injuries, subluxations, plantar fasciitis, headaches, tinnitus, vertigo, jaw pain to name a few. He is also highly experienced in whiplash and traumatic auto injuries.",
    "Available treatments include chiropractic manipulative therapy (CMT), physiotherapy, mechanical traction, electrical stimulation, interferential current (IFC), low-level laser therapy, therapeutic exercise instruction, myofascial release, neuromuscular re-education, trigger point therapy, lumbar core stabilization program, etc.",
    "For a Scottsdale Chiropractor with a sports injury and wellness emphasis, please call Dr. Kevin Turley of Turley Chiropractic at 480-994-0072 to schedule an appointment. Please visit www.chiropractor-scottsdale.com for more information or to schedule an appointment on-line. ",
    "sports chiropractor, scottsdale chiropractor, ASU chiropractor"
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(480) 994-0072",
  "Address": "1920 N Scottsdale Road, Scottsdale, AZ  85257"
}
{
  "First_and_Last_Name": "Leslie Gray, L.Ac",
  "About": "Leslie utilizes her knowledge and experiences to aid in balancing clients health. Leslie incorporates acupuncture and Chinese medicine to help relieve clients pain and stress. She also uses the amazing benefits of acupuncture to help correct digestive disorders, infertility, and anxiety related health issues. The Acupuncture Healing Center's relaxing and comfortable environment offers a place for individuals to finally find solutions to unresolved health issues.  If seeking acupuncture that works in  please call Leslie Gray today. Schedule a FREE mini stress acupuncture treatment",
  "Services": [
    " Acupuncture / Alternative Medicine",
    " Cosmetic Acupuncture",
    " Lifestyle Counseling",
    " Aromatherapy",
    " CranioSacral Therapy",
    " Master Tung's Acupuncture",
    " Auricular Acupuncture",
    " Cupping",
    " Moxibustion",
    " Balance Method Acupuncture",
    " Dietary Therapy and Nutrition",
    "Naturopathic Medicine",
    " Chi-Akra / Facial Acupuncture",
    " Electro-Acupuncture",
    " Qigong",
    " Chinese Herbal Medicine",
    " Gua Sha ",
    " Shiatsu (Acupressure)",
    " Homeopathic Medicine",
    " Tai Chi Chuan"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(9 Reviews)",
  "Phone": "(480) 843-7050",
  "Address": "9689 N. Hayden Road  34, Scottsdale, AZ  85250"
}
{
  "First_and_Last_Name": "Jeff Robinson, Dr.",
  "About": "Looking for a Scottsdale Chiropractor? We also incorporate Acupuncture, Gua Sha and have a Naturopathic Doctor> We also perform Prolotherapy, Colon Hydrotherapy, Colonics, Chelation, and IV drips to provide complete Holistic Care. We utilize Applied Kinesiology testing as well as labs to detect immune dysfunction and Food Sensitivities.  Located in North Scottsdale AZ in the DC Ranch McDowell Mountain Ranch area. Other services include Spinal Decompression, Gua Sha and Cupping. We treat Auto Accidents, Sports injuries, Whiplash, Back Pain, Neck Pain, Migraines, Headaches, Carpal Tunnel, Knee Pain, Rotator Cuff Injuries,Plantar Fascitis to name a few. ",
  "Services": [
    "chiropractic",
    "acupuncture",
    "applied Kinesiology",
    "Spinal Decompression",
    "Naturopathic Doctor",
    "chiropractor scottsdale, acupuncture scottsdale"
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(480) 991-5555",
  "Address": "16700 North Thompson Peak Parkway  suite 260, SCOTTSDALE, AZ  85260"
}
{
  "First_and_Last_Name": "Lloyd Wright, LAc, DNBAO",
  "About": "Stellar Physical Medicine provides a unique approach to integrated healthcare by combining Western Medicine with the best of Traditional Chinese Medicine. ",
  "Services": [
    "Acupuncture treatment and herbalist for:",
    "Acute and Chronic Pain:",
    "Migraine Headaches",
    "Arthritis pain, plantar fasciitis ",
    "Sports and work injuries ",
    "Respiratory Disorders:",
    "Allergies ",
    "Asthma ",
    "​Flu and Colds ",
    "Digestive Disorders, Gastritis, ",
    "​mal-absorption:",
    "Colitis & Irritable Bowel Syndrome ",
    "Women’s Health:",
    "Infertility ",
    "Menopausal Symptoms ",
    "​Premenstrual Syndrome and pain ",
    "Orthopedics, pain, injury, allergies, digestive disorder"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "35",
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(11 Reviews)",
  "Phone": "(480) 423-3525",
  "Address": "9301 E Shea Blvd  Suite 118, Scottsdale, AZ  85260"
}
{
  "First_and_Last_Name": "Martha Jane Ivey",
  "About": "Martha Jane Ivey practices as an  Acupuncturist in Birmingham, AL.",
  "Services": [
    "Martha Jane Ivey is an Acupuncturist or Acupuncture office in Birmingham, AL. Call Martha Jane Ivey at (205) 324-6003 for a detailed description of the services offered. ",
    "Acupuncturist like Martha Jane Ivey offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Martha Jane Ivey for information about your acupuncture needs in Birmingham, AL."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(205) 324-6003",
  "Address": "603 37th St. South, Birmingham, AL  35222"
}
{
  "First_and_Last_Name": "Rama Khalsa",
  "About": "Rama Khalsa practices as an  Acupuncturist in Birmingham, AL.",
  "Services": [
    "Rama Khalsa is an Acupuncturist or Acupuncture office in Birmingham, AL. Call Rama Khalsa at (205) 266-3834 for a detailed description of the services offered. ",
    "Acupuncturist like Rama Khalsa offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Rama Khalsa for information about your acupuncture needs in Birmingham, AL."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(205) 266-3834",
  "Address": "1901 Richard Arrington Jr Blvd, Birmingham, AL  35205"
}
{
  "First_and_Last_Name": "CYNTHIA POPPE",
  "About": "Growing up in Arizona, Cynthia has watched our state grow and develop into one of the best holistic and integrative healing communities in the country. She is happy to bring her unique experience in healthcare to her patients.  ",
  "Services": [
    "Acupuncturist"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": null,
  "Address": null
}
{
  "First_and_Last_Name": "Whitney B Goldfine",
  "About": "Whitney B Goldfine practices as an  Acupuncturist in Cave Creek, AZ.",
  "Services": [
    "Whitney B Goldfine is an Acupuncturist or Acupuncture office in Cave Creek, AZ. Call Whitney B Goldfine at (480) 205-3623 for a detailed description of the services offered. ",
    "Acupuncturist like Whitney B Goldfine offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Whitney B Goldfine for information about your acupuncture needs in Cave Creek, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(3 Reviews)",
  "Phone": "(480) 205-3623",
  "Address": "29259 N. 49th St., Cave Creek, AZ  85331"
}
{
  "First_and_Last_Name": "CAMRRON LARSON, D.C.",
  "About": "CAMRRON LARSON, D.C. practices as a  Chiropractor in Cave Creek, AZ.",
  "Services": [
    "CAMRRON LARSON, D.C. practices at 4730 E Lone Mountain Rd 112, Cave Creek, AZ  85331. Chiropractors diagnose and treat common spinal misalignments that can occur from lifestyle or injuries causing pain, discomfort and degenerative conditions.",
    "CAMRRON LARSON, D.C. may be able to treat; back pain, sciatica, neck pain, shoulder pain, headaches, sports injuries, and auto accident injuries. ",
    "To learn more, or to make an appointment with CAMRRON LARSON, D.C. in Cave Creek, AZ, please call (480) 275-7005 for more information.",
    "Acupuncture, Massage, Cold Laser, Nutrition"
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(3 Reviews)",
  "Phone": "(480) 275-7005",
  "Address": "4730 E Lone Mountain Rd 112, Cave Creek, AZ  85331"
}
{
  "First_and_Last_Name": "Estelle Farrell, DO",
  "About": "A collection of health practitioners focused on whole person care.  Body Mind, Soul And function.  Dr Farrel is skilled in pain management techniques, Osteopathic manipulation, acupuncture and many modalities while also be very traditional and science based in her care.",
  "Services": [
    "See above",
    "Scar treatment, pain, regenerative, proactive, "
  ],
  "Primary_Specialty": "Pain Management Specialist",
  "Practice": "23",
  "Education": [
    "Des Moines University Osteopathic School"
  ],
  "Training": [
    "Memorial-Sloan Kettering, NY Hospital and Temple University"
  ],
  "Consumer_Feedback": "(9 Reviews)",
  "Phone": "(480) 874-5806",
  "Address": "4900 N Scottsdale Road 2400, Scottsdale, AZ  85251"
}
{
  "First_and_Last_Name": "Julie Gannon, O.D.",
  "About": "Julie Gannon, O.D. practices as an  Acupuncturist in Birmingham, AL.",
  "Services": [
    "Julie Gannon, O.D. is an Acupuncturist or Acupuncture office in Birmingham, AL. Call Julie Gannon, O.D. at (205) 930-0930 for a detailed description of the services offered. ",
    "Acupuncturist like Julie Gannon, O.D. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Julie Gannon, O.D. for information about your acupuncture needs in Birmingham, AL."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(205) 930-0930",
  "Address": "1201 11th Avenue S, Suite 501, Birmingham, AL  35205"
}
{
  "First_and_Last_Name": "Edmond Zlotea, Dr.",
  "About": "My name is Dr. Edmond Zlotea (Dr. Z).",
  "Services": [
    "We provide:",
    "Alternative Medicine",
    "Gentle Chiropractic",
    "Physiotherapy",
    "Depression & Anxiety Protocol",
    "Acupuncture",
    "Traditional Chiropractic Adjustment",
    "Electric Muscle Stimulation",
    "Laser Therapy",
    "Infrared Light Therapy",
    "Massage Therapy",
    "Neurologic Relief Centers Technique",
    "Spinal Decompression Therapy",
    "MyoFascial Disruption Technique",
    "Ultrasound Therapy",
    "Graston Technique",
    "Chiropractic Traction",
    "Trigger Point Therapy",
    "Acupuncture"
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(334) 699-3362",
  "Address": "1801 West Main Street Suite 5, Dothan, AL  36301"
}
{
  "First_and_Last_Name": "Randall S. (Randy) Hall, B.S., D.C., F.I.A.M.A.",
  "About": "Dothan Wellness (Acupuncture – Chiropractic) offers affordable acupuncture and chiropractic care in a clean, safe and family friendly environment.  You will be taken care of with the same level of care and concern that we give to our own family.  No long patient intake forms to fill out, only two simple sheets of paper and you are ready for your exam...that's it.  Call us at (334) 446-0222",
  "Services": [
    "We utilize Acupuncture, Chiropractic, Nutrition and Postural strengthening to allow you to feel great and to perform at  your best. ",
    "Chiropractic"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "22",
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(5 Reviews)",
  "Phone": "(334) 446-0222",
  "Address": "407 Honeysuckle Road  Suite 107, Dothan, AL  36305"
}
{
  "First_and_Last_Name": "Acupuncture Clinic",
  "About": "Acupuncture Clinic is a Acupuncturist facility at 3245 Lorna Rd in Birmingham, AL.",
  "Services": [
    "Acupuncture Clinic is an Acupuncturist or Acupuncture office in Birmingham, AL. Call Acupuncture Clinic at (205) 979-4079 for a detailed description of the services offered. ",
    "Acupuncturist like Acupuncture Clinic offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Acupuncture Clinic for information about your acupuncture needs in Birmingham, AL."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(205) 979-4079",
  "Address": "3245 Lorna Rd, Birmingham, AL  35216"
}
{
  "First_and_Last_Name": "Chiropractor, Acupuncture",
  "About": "Chiropractor, Acupuncture practices as a  Chiropractic Sports Physician in Birmingham, AL.",
  "Services": [
    "Chiropractor, Acupuncture is a Chiropractic Sports Physician/office located in Birmingham, AL 35213. A Chiropractic Sports Physician is a fully trained chiropractor who is trained to offer care for athletes in the management, rehabilitation, and performance optimization of their neuromusculoskeletal systems. Chiropractic Sports Physicians are responsible for advancements in protective gear and have played a role in preventing spinal injuries in athletes. ",
    "Please call Chiropractor, Acupuncture at (205) 957-5445 to schedule an appointment in Birmingham, AL or to get more information.",
    "Acupuncture"
  ],
  "Primary_Specialty": "Chiropractic Sports Physician",
  "Practice": "31",
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(205) 957-5445",
  "Address": "972 Molntclair Rd, Birmingham, AL  35213"
}
{
  "First_and_Last_Name": "Martha Ivey",
  "About": "Martha Ivey practices as an  Acupuncturist in Birmingham, AL.",
  "Services": [
    "Martha Ivey is an Acupuncturist or Acupuncture office in Birmingham, AL. Call Martha Ivey at (205) 324-6003 for a detailed description of the services offered. ",
    "Acupuncturist like Martha Ivey offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Martha Ivey for information about your acupuncture needs in Birmingham, AL."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(6 Reviews)",
  "Phone": "(205) 324-6003",
  "Address": "603 37th Street  South, Birmingham, AL  35222"
}
{
  "First_and_Last_Name": "Ramsay Falcove",
  "About": "Ramsay Falcove practices as an  Acupuncturist in Birmingham, AL.",
  "Services": [
    "Ramsay Falcove is an Acupuncturist or Acupuncture office in Birmingham, AL. Call Ramsay Falcove at (205) 369-0385 for a detailed description of the services offered. ",
    "Acupuncturist like Ramsay Falcove offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Ramsay Falcove for information about your acupuncture needs in Birmingham, AL."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(5 Reviews)",
  "Phone": "(205) 369-0385",
  "Address": "1730 B Valley Ave, Birmingham, AL  35209"
}
{
  "First_and_Last_Name": "Cherie Johnson, Dr.",
  "About": "Cherie Johnson, Dr. practices as a  Chiropractor in Birmingham, AL.",
  "Services": [
    "Cherie Johnson, Dr. practices at 2800 Greystone Commercial Blvd. Suite 2B, Birmingham, AL  35242. Chiropractors diagnose and treat common spinal misalignments that can occur from lifestyle or injuries causing pain, discomfort and degenerative conditions.",
    "Cherie Johnson, Dr. may be able to treat; back pain, sciatica, neck pain, shoulder pain, headaches, sports injuries, and auto accident injuries. ",
    "To learn more, or to make an appointment with Cherie Johnson, Dr. in Birmingham, AL, please call (205) 408-5600 for more information.",
    "chiropractic care, acupuncture, nutrition,"
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": "23",
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(205) 408-5600",
  "Address": "2800 Greystone Commercial Blvd. Suite 2B, Birmingham, AL  35242"
}
{
  "First_and_Last_Name": "GERALD COLLINS, DC",
  "About": "OVER 28 YEARS EXPERIENCE IN TREATING AUTO ACCIDENTS AND DISC INJURIES.  WE OFFER COURTESY TRANSPORTATION IF YOUR CAR IS DISABLED DUE TO THE ACCIDENT.  FEDERAL ENTITLEMENTS ARE EXCLUDED.    ",
  "Services": [
    "GERALD COLLINS, DC practices at 552 BESSEMER HWY, MIDFIELD, AL  35228. Chiropractors diagnose and treat common spinal misalignments that can occur from lifestyle or injuries causing pain, discomfort and degenerative conditions.",
    "GERALD COLLINS, DC may be able to treat; back pain, sciatica, neck pain, shoulder pain, headaches, sports injuries, and auto accident injuries. ",
    "To learn more, or to make an appointment with GERALD COLLINS, DC in MIDFIELD, AL, please call (205) 923-0151 for more information."
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": "40",
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(9 Reviews)",
  "Phone": "(205) 923-0151",
  "Address": "552 BESSEMER HWY, MIDFIELD, AL  35228"
}
{
  "First_and_Last_Name": "Yao  Lu, Dr",
  "About": "Welcome to Auricular Medicine International Research & Training Center online! For more than 10 years, we have provided to all people worldwide with professional auricular medicine services to help improve their mental and physical health. Our services are perfect for anyone who wishes to enhance their current health, relieve pain and stress, or recover from illness or injury.",
  "Services": [
    "We offer various type Acupuncture medicine services as following:",
    "Chronicle Ache Treatment:",
    "Fibromyositis of shoulder and back, mid back pain, sciatic neuralgia, gout, history of injuries, tennis or golf elbow, tingling, arthritis, periarthritis shoulder, cramps.",
    "Disturbed Nerve Function Treatment:",
    "Neurasthenia insomnia, depression treatment, nerve system, numbness, migraine, anxiety, fatigue, psychoneurosis, facial paralysis, disturbed function of autonomic nerve, stroke paralysis.",
    "Allergic Diseases Treatment:",
    "Pollen hypersensitivity, Seasonal Allergies, nasal symptom allergies.",
    "Internal Diseases Treatment:",
    "Asthma, bronchitis, chronic gastritis, gastric ulcer, duodenal ulcer, consternation, hemorrhoid, diarrhea, chronic cholecystitis.",
    "Chinese Cupping Service:",
    "Cupping therapy is an Chinese alternative medicine where using a small glass cup with heat created by fire to generate a suction in the surface of the skin which could mobilize the blood flow movement to promote different type of pain and self healing.",
    "Chinese Acupressure Service:",
    "Chinese Acupressure is an alternative ancient healing medicine which using a set of standard finger massage movement on human body healing points, the purpose of the acupressure practice is to stimulate the body's natural self healing abilities.",
    "Chinese Moxibustion Service:",
    "Moxibustion is a Alternative traditional Chinese medicine therapy using Moxa made from dried Mugwort.",
    "Chinese Gua Sha Service:",
    "Gua Sha means scraping bruises on the skin, it is a alternative traditional Chinese medicine treatment in which the skin is scraped to produce light bruising.",
    "Chinese Reflexology Service:",
    "Reflexology is focusing special type of massage movement on the areas of the feet that practitioners believe correspond with organs in different part the body to diagnosis and promote healing.",
    "Chinese Herbs:",
    "Chinese Herbs is the eastern alternative traditional theory of Chinese herbal therapy, which is a part of nutritional treatments consisted in traditional Chinese medicine (TCM).",
    "And a Lot Acupuncture medicine not to list here",
    "Auricular Medicine"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "14",
  "Education": [
    "Beijing Medical College,China in 1987"
  ],
  "Training": [
    "Auricular Medicine Therapy"
  ],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(205) 527-4202",
  "Address": "2104 Chapel Hill Rd, Birmingham, AL  35266"
}
{
  "First_and_Last_Name": "Karin Hilsdale",
  "About": "Karin Hilsdale practices as an  Acupuncturist in Green Valley, AZ.",
  "Services": [
    "Karin Hilsdale is an Acupuncturist or Acupuncture office in Green Valley, AZ. Call Karin Hilsdale at (520) 841-2448 for a detailed description of the services offered. ",
    "Acupuncturist like Karin Hilsdale offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Karin Hilsdale for information about your acupuncture needs in Green Valley, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(520) 841-2448",
  "Address": "231 West Duval Rd Suite A, Green Valley, AZ  85614"
}
{
  "First_and_Last_Name": "Jamie Fitzgerald",
  "About": "At The Healing Point Acupuncture and Herbal Medicine we provide quality, efficient and affordable healthcare to meet the changing needs of our community. With Healthcare costs high and unpredictable Traditional Chinese medicine provides both remedial and preventive care with individual treatment plans to meet the specific goals of each patient.",
  "Services": [
    "At The Healing Point the acupuncture treatment is only a small part of a natural & therapeutic Chinese medical system. Jamie utilizes all five branches of traditional Chinese medicine; acupuncture, herbal medicine, dietetics, energetics and therapeutic massage. This includes the modalities of cupping, tui na, gua sha, qi gong, moxibustion and e-stim. ",
    "Traditional Chinese Medicine can treat a wide variety conditions including but not limited to; Pain and Musculoskeletal Disorders, Ear, Eye, Nose & Throat Disorders, Gastrointestinal Disorders, Circulatory/Heart disease, Gynecological & Genitourinary Disorders, Respiratory Disorders, Nervous System Disorders, Emotional & Psychological Disorders, Addiction, Weight loss & Nutritional Goals, Supportive Therapy for the Symptoms of Cancer & Chemotherapy , Diseases of the Bone, Fertility & Supportive Measure for Pregnancy",
    "Jamie is passionate about patient communication, so don't hesitate to call if you any questions.",
    "Herbal Medicine, Traditional Chinese Medicine, Massage, Tui Na, Cupping, Pain Management, Nutrition, Weight Loss, Fertility, Parkinson's Disease"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [
    "Jamie Fitzgerald MTCM LAc LMT earned her Master's Degree in Traditional Chinese Medicine at Five Branches University. She was also privileged to complete her internship in Hangzhou, China at the prestigious Zhejiang Chinese Medical University. While interning she specialized in, TCM internal medicine, Acupuncture, Tui Na and Gynecology. Currently, Jamie is the owner of The Healing Point Acupuncture and Herbal Medicine Clinic in Mesa, AZ. She also partners with other local practitioners to run East Valley Community Acupuncture Clinic, a low-cost community acupuncture clinic on Monday evenings",
    "Jamie began her education in Complementary Medicine over 14 years ago, She first became certified in the Japanese Healing method, Reiki. Then, after her undergraduate studies in psychology at ASU, Jamie graduated from Southwest Institute of the Healing Arts, certified as a Master Massage therapist as well as Natural Aesthetician."
  ],
  "Training": [],
  "Phone": "(480) 648-6998",
  "Address": "2266 S Dobson Rd, Mesa, AZ  85202"
}
{
  "First_and_Last_Name": "Kiera U. Lane",
  "About": "Kiera U. Lane practices as an  Acupuncturist in Chandler, AZ.",
  "Services": [
    "Kiera U. Lane is an Acupuncturist or Acupuncture office in Chandler, AZ. Call Kiera U. Lane at (480) 722-2811 for a detailed description of the services offered. ",
    "Acupuncturist like Kiera U. Lane offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Kiera U. Lane for information about your acupuncture needs in Chandler, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 722-2811",
  "Address": "2480 W Ray Rd Ste 1, Chandler, AZ  85224"
}
{
  "First_and_Last_Name": "Dr. Ryan Aimsworth, Owner/Veterinarian",
  "About": "Dr. Ryan Aimsworth, Owner/Veterinarian practices as an  Animal Hospital in Mesa, AZ.",
  "Services": [
    "Dr. Ryan Aimsworth, Owner/Veterinarian practices at 3109 E McKellips Rd 3109 E McKellips Rd, Mesa, AZ  85213.",
    "Animal hospitals offer general and emergency pet care services. Some animal hospitals offer 24 hour emergency services-call to confirm hours and availability.",
    "To learn more, or to make an appointment with Dr. Ryan Aimsworth, Owner/Veterinarian in Mesa, AZ, please call (480) 210-5610 for more information."
  ],
  "Primary_Specialty": "Animal Hospital",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": "(480) 210-5610",
  "Address": "3109 E McKellips Rd 3109 E McKellips Rd, Mesa, AZ  85213"
}
{
  "First_and_Last_Name": "DANIEL BAUM, D.C.",
  "About": "DANIEL BAUM, D.C. practices as a  Chiropractor in Chandler, AZ.",
  "Services": [
    "DANIEL BAUM, D.C. practices at 725 S Dobson Rd., Ste 100, Chandler, AZ  85224. Chiropractors diagnose and treat common spinal misalignments that can occur from lifestyle or injuries causing pain, discomfort and degenerative conditions.",
    "DANIEL BAUM, D.C. may be able to treat; back pain, sciatica, neck pain, shoulder pain, headaches, sports injuries, and auto accident injuries. ",
    "To learn more, or to make an appointment with DANIEL BAUM, D.C. in Chandler, AZ, please call (602) 795-8700 for more information."
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": "35",
  "Education": [],
  "Training": [],
  "Phone": "(602) 795-8700",
  "Address": "725 S Dobson Rd., Ste 100, Chandler, AZ  85224"
}
{
  "First_and_Last_Name": "Lea Inoue",
  "About": "Lea Inoue is a Acupuncturist facility in Mesa, AZ.",
  "Services": [
    "Lea Inoue is an Acupuncturist or Acupuncture office in Mesa, AZ. Call Lea Inoue at  for a detailed description of the services offered. ",
    "Acupuncturist like Lea Inoue offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Lea Inoue for information about your acupuncture needs in Mesa, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Phone": null,
  "Address": "Mesa, AZ  85210"
}
{
  "First_and_Last_Name": "M Jean Painter, DpOM, CH, Ac., L.Ac",
  "About": "M Jean Painter, DpOM, CH, Ac., L.Ac practices as an  Acupuncturist in Prescott, AZ.",
  "Services": [
    "M Jean Painter, DpOM, CH, Ac., L.Ac is an Acupuncturist or Acupuncture office in Prescott, AZ. Call Harmony Integrative Medicine at (928) 776-4895 for a detailed description of the services offered. ",
    "Acupuncturist like M Jean Painter, DpOM, CH, Ac., L.Ac offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Harmony Integrative Medicine for information about your acupuncture needs in Prescott, AZ.",
    "Advanced Acupuncture and Oriental Medicine"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(2 Reviews)",
  "Phone": "(928) 776-4895",
  "Address": "1745 Rustic Timbers Ln,   D, Prescott, AZ  86303"
}
{
  "First_and_Last_Name": "Karl Stertzbach, L.Ac.",
  "About": "Traeger K. Staterzbach L.Ac. is an acupuncturist and herbalist currently practicing Oriental Medicine in Prescott AZ. With a bachelor degree from Prescott College in Environmental Studies and a Diplomate in Oriental Medicine and Acupuncture from the Oregon College of Oriental Medicine, his interest in complementary and alternative medicine grew out of the connections between the state of the human condition and the state of our environmental and planetary health.",
  "Services": [
    "Karl Stertzbach, L.Ac. is an Acupuncturist or Acupuncture office in Prescott, AZ. Call Synergy Wellness Center at (928) 227-1899 for a detailed description of the services offered. ",
    "Acupuncturist like Karl Stertzbach, L.Ac. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Synergy Wellness Center for information about your acupuncture needs in Prescott, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(928) 227-1899",
  "Address": "607 W. Gurley St., Prescott, AZ  86305"
}
{
  "First_and_Last_Name": "Ping Yang",
  "About": "Ping Yang practices as an  Acupuncturist in Mesa, AZ.",
  "Services": [
    "Ping Yang is an Acupuncturist or Acupuncture office in Mesa, AZ. Call AZ Chinese Acupuncture Center at (480) 777-8513 for a detailed description of the services offered. ",
    "Acupuncturist like Ping Yang offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at AZ Chinese Acupuncture Center for information about your acupuncture needs in Mesa, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(14 Reviews)",
  "Phone": "(480) 777-8513",
  "Address": "2045 S. Vineyard Suite 147 , Mesa, AZ  85210"
}
{
  "First_and_Last_Name": "Peter Dufour IV, D.C., F.I.A.M.A.",
  "About": "Dr. Peter J. Dufour IV, D.C., F.I.A.M.A. as been named East Valley Tribune's Best Of Gilbert for 2019, 2017, 2016, 2015 and (3rd in 2018). ",
  "Services": [
    "If you're \"DU-FOUR\" an adjustment? Stop in and see what \"Doc Dufour can Du-Four YOU!\"",
    "480-839-BACK",
    "The First Chiropractic Choice in Gilbert and Chandler for Urgent care of Auto Accidents, Work Injuries, Emergency Chiropractic Care and treatment for the entire Neck, Back and Body",
    " ",
    "IS... The Dufour Accident Chiropractic and Acupuncture Center. ",
    "Take back control of your life and make Dr. Dufour your Personal Injury Chiropractor.  He has been helping to relief pain in Gilbert, Chandler, Mesa, Tempe and Queen Creek and has over 22 years experience!",
    "Pete Dufour"
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": "24",
  "Education": [
    "Life University, School of Chiropractic located in beautiful downtown Marietta, Ga"
  ],
  "Training": [
    "Dr. Dufour is Board Certified in the State of Arizona as a Chiropractic Physician utilizing an array of adjusting techniques along with in office physiotherapy, X-rays and Acupuncture for pain relief. Two years after achieving his Doctorate in Chiropractic, Dr. Dufour pressed on and obtained the distinction of Fellowship in the International Academy of Medical Acupuncture."
  ],
  "Consumer_Feedback": "(20 Reviews)",
  "Phone": "(480) 390-8350",
  "Address": "1467 W.Elliot rd, Ste 103 1467 W.Elliot rd, Gilbert, AZ  85233"
}
{
  "First_and_Last_Name": "Simon Shim",
  "About": "Simon Shim practices as an  Acupuncturist in Chandler, AZ.",
  "Services": [
    "Simon Shim is an Acupuncturist or Acupuncture office in Chandler, AZ. Call Simon Shim at (480) 821-6020 for a detailed description of the services offered. ",
    "Acupuncturist like Simon Shim offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Simon Shim for information about your acupuncture needs in Chandler, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(480) 821-6020",
  "Address": "600 S.Dobson RD. #D-34, Chandler, AZ  85224"
}
{
  "First_and_Last_Name": "David M. Christensen, O.D.",
  "About": "David M. Christensen, O.D. practices as an  Acupuncturist in Chandler, AZ.",
  "Services": [
    "David M. Christensen, O.D. is an Acupuncturist or Acupuncture office in Chandler, AZ. Call David M. Christensen, O.D. at (480) 786-1075 for a detailed description of the services offered. ",
    "Acupuncturist like David M. Christensen, O.D. offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at David M. Christensen, O.D. for information about your acupuncture needs in Chandler, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(480) 786-1075",
  "Address": "2050 N Alma School Rd Ste 14, Chandler, AZ  85224"
}
{
  "First_and_Last_Name": "Qun Li",
  "About": "Qun Li practices as an  Acupuncturist in Chandler, AZ.",
  "Services": [
    "Qun Li is an Acupuncturist or Acupuncture office in Chandler, AZ. Call Qun Li at (480) 967-3133 for a detailed description of the services offered. ",
    "Acupuncturist like Qun Li offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Qun Li for information about your acupuncture needs in Chandler, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(4 Reviews)",
  "Phone": "(480) 967-3133",
  "Address": "2360 West Ray Rd., Suite 4, Chandler, AZ  85224"
}
{
  "First_and_Last_Name": "Yunsil Kim Fortini",
  "About": "I use the Kiiko Matsumoto's Clinical Strategies technique when treating a patient which includes the 5 element tradition Acupuncture. Personalized treatment methods are expected to be",
  "Services": [
    "Allergies..Anxiety..Arthritis..Asthma..Back & Disk Problems..Blood Pressure..Carpal Tunnel..Cholesterol..Colds, Cough & Flu..",
    "Dental..Depression.. Diabetes..Digestion/Intestine..Emotional Wellbeing..Facial Rejuvenation..Fibromyalgia..Headache/Migraine..",
    "Infertility.. Muscle Aches, Spraines & Straines..Neck & Shoulder Pain..Pain Management..Skin Problems/Dermatology..Smoking.. Sleep/Insomnia..Spinal Problems..Sports Medicine..Stress..Urology.",
    "Weight Management..Womens Health/ObGyn..Yeast............ "
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(3 Reviews)",
  "Phone": "(480) 789-9574",
  "Address": "863 W. Raven Dr. , Chandler, AZ  85286"
}
{
  "First_and_Last_Name": "Ubong Attah Prince, ND",
  "About": "We are a naturopathic medical practice based in the Phoenix, AZ area.  Our providers offer comprehensive, effective, and individualized medical care to patients of all ages. We use a wide variety of natural healing modalities to address a number of health conditions.",
  "Services": [
    "Medical Weight Loss",
    "Natural or Biodentical Hormone Replacement",
    "Acupuncture",
    "Intravenous & Injection Therapy",
    "Weight Loss Injections",
    "We treat: high blood pressure, infertility, digestive disorders, diabetes, obesity, high blood pressure (hypertension), and chronic disease"
  ],
  "Primary_Specialty": "Naturopathic Doctor",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(7 Reviews)",
  "Phone": "(480) 666-5505",
  "Address": "633 E Ray Road 110, Gilbert, AZ  85296"
}
{
  "First_and_Last_Name": "Jason Mulder, Doctor",
  "About": "True Health Medical is a full service Medicine Clinic. We are what medicine should be for the entire family!  ",
  "Services": [
    "Some of the techniques we focus on in our clinic include:",
    "General Medicine ",
    "Migraine Treatments",
    "Trigger Point Injections",
    "Spinal Decompression",
    "Digital Pulse Analysis (Complete Cardiovascular Evaluation)",
    "Deep Muscle Stimulation",
    "Acupuncture",
    "Allergy treatments",
    "DMS Massage",
    "Nutrition",
    "Body Mass Index",
    "Doctor Supervised Weight-loss Programs",
    "Gentle Chiropractic Adjustments ",
    "And much, much more...",
    "General Medicine, Physical Medicine, Migraines, Arthritis, Neck Pain, Back Pain, Knee Pain,"
  ],
  "Primary_Specialty": "General Practitioner",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(1 Review)",
  "Phone": "(480) 802-9977",
  "Address": "3220 S Gilbert Rd  Suite 4, Chandler, AZ  85286"
}
{
  "First_and_Last_Name": "Brent Timco, L.Ac,CH,DiplOM",
  "About": "Brent Timco, L.Ac,CH,DiplOM practices as an  Acupuncturist in Gilbert, AZ.He graduated from Phoenix Institute of Herbal Medicine & Acupuncture and has been practicing since 2005.",
  "Services": [
    "Brent Timco, L.Ac,CH,DiplOM is an Acupuncturist or Acupuncture office in Gilbert, AZ. Call Common Root Herbal Medicine & Acupuncture at (480) 773-4200 for a detailed description of the services offered. ",
    "Acupuncturist like Brent Timco, L.Ac,CH,DiplOM offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Common Root Herbal Medicine & Acupuncture for information about your acupuncture needs in Gilbert, AZ."
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": "15",
  "Education": [
    "Phoenix Institute of Herbal Medicine & Acupuncture"
  ],
  "Training": [],
  "Consumer_Feedback": "(6 Reviews)",
  "Phone": "(480) 773-4200",
  "Address": "1355 S. Higley Rd. #109, Gilbert, AZ  85296"
}
{
  "First_and_Last_Name": "Dan Graham, DC, Owner",
  "About": "Medical doctors, chiropractors, physiotherapists all under one roof to benefit you.  Dr. Dan has been the AZ chiropractor for the Angels for 4 years in the past along with treating multiple other athletes from football, baseball, hockey, MMA, and pro wrestling.  He co hosts a health talk radio show in the Phoenix area on KOOL, KMLE, and KZON on Sunday mornings.  He is also certified in auto accident treatment protocol with the Spine Research Institute of San Diego.",
  "Services": [
    "Chiropractic",
    "Physiotherapy",
    "Acupuncture",
    "PENS",
    "Suboxone",
    "Medical Weight Loss",
    "Joint Injections",
    "Personal Training"
  ],
  "Primary_Specialty": "Chiropractor",
  "Practice": "68",
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(13 Reviews)",
  "Phone": "(480) 219-6354",
  "Address": "323 S. Gilbert Road 119, Gilbert, AZ  85296"
}
{
  "First_and_Last_Name": "Betty Wang",
  "About": "Betty Wang practices as an  Acupuncturist in Gilbert, AZ.",
  "Services": [
    "Betty Wang is an Acupuncturist or Acupuncture office in Gilbert, AZ. Call Betty Wang at (480) 272-2098 for a detailed description of the services offered. ",
    "Acupuncturist like Betty Wang offer services that often include facial renewal acupuncture, cupping, moxibustion, Gua Sha, Zen Shiatsu, Chinese herbal formula, herbal medicine, smoking cessation and Traditional Chinese Medicine (TCM). Talk to the staff at Betty Wang for information about your acupuncture needs in Gilbert, AZ.",
    "Chinese Herbalist"
  ],
  "Primary_Specialty": "Acupuncturist",
  "Practice": null,
  "Education": [],
  "Training": [],
  "Consumer_Feedback": "(18 Reviews)",
  "Phone": "(480) 272-2098",
  "Address": " 2730 South Val Vista Drive suite 159, Gilbert, AZ  85296"
}
